[
    {
        "id": 1,
        "number": 1,
        "name_arabic": "الرَّحْمَنُ",
        "name_transliteration": "Ar-Rahman",
        "name_english": "The Most Gracious",
        "meaning": "The one who has plenty of mercy for all creation, believers and non-believers alike.",
        "explanation": "Ar-Rahman refers to Allah's all-encompassing mercy that extends to every living creature. This attribute is unique to Allah alone and cannot be used for anyone else. It signifies the vastness and immediacy of divine mercy.",
        "benefits": "Reciting this name softens the heart and invites divine mercy and compassion into one's life.",
        "quran_references": ["1:1", "59:22", "55:1"],
        "usage_in_dua": "Ya Rahman, envelop us in Your mercy and guide us to Your straight path.",
        "display_order": 1
    },
    {
        "id": 2,
        "number": 2,
        "name_arabic": "الرَّحِيمُ",
        "name_transliteration": "Ar-Rahim",
        "name_english": "The Most Merciful",
        "meaning": "The one who bestows special and continuous mercy upon the believers.",
        "explanation": "Ar-Rahim denotes Allah's specific mercy reserved for the faithful in this world and the hereafter. While Ar-Rahman covers all creation, Ar-Rahim focuses on sustained, nurturing mercy for those who believe. It appears frequently paired with Ar-Rahman.",
        "benefits": "Invoking this name draws Allah's special mercy and protection for the believer.",
        "quran_references": ["1:1", "2:163", "59:22"],
        "usage_in_dua": "Ya Rahim, shower Your special mercy upon us and forgive our shortcomings.",
        "display_order": 2
    },
    {
        "id": 3,
        "number": 3,
        "name_arabic": "الْمَلِكُ",
        "name_transliteration": "Al-Malik",
        "name_english": "The King",
        "meaning": "The absolute sovereign and ruler of all that exists.",
        "explanation": "Al-Malik signifies Allah's complete dominion and authority over the entire universe. He is the King of kings, whose sovereignty is eternal and unchallenged. All creation is under His command and governance.",
        "benefits": "Remembering this name cultivates humility and recognition of Allah's supreme authority over all affairs.",
        "quran_references": ["59:23", "20:114", "23:116"],
        "usage_in_dua": "Ya Malik, You are the King of all creation; grant us from Your boundless kingdom.",
        "display_order": 3
    },
    {
        "id": 4,
        "number": 4,
        "name_arabic": "الْقُدُّوسُ",
        "name_transliteration": "Al-Quddus",
        "name_english": "The Most Holy",
        "meaning": "The one who is pure and free from all imperfections and defects.",
        "explanation": "Al-Quddus means Allah is absolutely pure, sacred, and free from any fault or shortcoming. He transcends all imperfections that could be attributed to creation. Everything in the heavens and earth glorifies His holiness.",
        "benefits": "Invoking this name purifies the heart and mind from spiritual ailments and negative thoughts.",
        "quran_references": ["59:23", "62:1"],
        "usage_in_dua": "Ya Quddus, purify our hearts from all that displeases You.",
        "display_order": 4
    },
    {
        "id": 5,
        "number": 5,
        "name_arabic": "السَّلَامُ",
        "name_transliteration": "As-Salam",
        "name_english": "The Source of Peace",
        "meaning": "The one who is the source of all peace and safety, free from all deficiencies.",
        "explanation": "As-Salam signifies that Allah is the ultimate source of peace, security, and tranquility. He greets the inhabitants of Paradise with peace and His very essence is free from any imperfection. All true peace in the world originates from Him.",
        "benefits": "Reciting this name brings inner peace, tranquility, and protection from harm.",
        "quran_references": ["59:23", "36:58", "10:25"],
        "usage_in_dua": "Ya Salam, grant us peace in our hearts, homes, and communities.",
        "display_order": 5
    },
    {
        "id": 6,
        "number": 6,
        "name_arabic": "الْمُؤْمِنُ",
        "name_transliteration": "Al-Mu'min",
        "name_english": "The Granter of Security",
        "meaning": "The one who grants security and confirms the truth of His promises.",
        "explanation": "Al-Mu'min means Allah is the one who bestows faith and security upon His creation. He fulfills His promises and confirms the truthfulness of His messengers through signs and miracles. He provides safety from His punishment to those who believe.",
        "benefits": "Calling upon this name strengthens faith and brings a sense of divine security and trust.",
        "quran_references": ["59:23"],
        "usage_in_dua": "Ya Mu'min, strengthen our faith and grant us security from all fears.",
        "display_order": 6
    },
    {
        "id": 7,
        "number": 7,
        "name_arabic": "الْمُهَيْمِنُ",
        "name_transliteration": "Al-Muhaymin",
        "name_english": "The Guardian",
        "meaning": "The one who watches over and protects all of creation.",
        "explanation": "Al-Muhaymin signifies Allah's role as the ever-watchful guardian over all things. He oversees and preserves the affairs of His creation with perfect knowledge. Nothing escapes His vigilant care and supervision.",
        "benefits": "Invoking this name brings divine protection and watchful care over one's affairs.",
        "quran_references": ["59:23"],
        "usage_in_dua": "Ya Muhaymin, watch over us and protect us from every harm and evil.",
        "display_order": 7
    },
    {
        "id": 8,
        "number": 8,
        "name_arabic": "الْعَزِيزُ",
        "name_transliteration": "Al-Aziz",
        "name_english": "The Almighty",
        "meaning": "The one who possesses ultimate power and might that none can overcome.",
        "explanation": "Al-Aziz denotes Allah's incomparable might and invincibility. He is the one whom nothing can defeat or resist, and all strength ultimately belongs to Him. His power is combined with wisdom and mercy.",
        "benefits": "Reciting this name brings strength, dignity, and honor from Allah.",
        "quran_references": ["59:23", "3:6", "14:4"],
        "usage_in_dua": "Ya Aziz, grant us honor and strength through Your almighty power.",
        "display_order": 8
    },
    {
        "id": 9,
        "number": 9,
        "name_arabic": "الْجَبَّارُ",
        "name_transliteration": "Al-Jabbar",
        "name_english": "The Compeller",
        "meaning": "The one who compels all things according to His will and mends the broken.",
        "explanation": "Al-Jabbar has a dual meaning: Allah compels creation to follow His divine will, and He also mends and restores what is broken. He reforms the affairs of His creation and no one can resist His decree. He is the one who heals broken hearts and restores what is lost.",
        "benefits": "Invoking this name brings comfort to the brokenhearted and strength against oppression.",
        "quran_references": ["59:23"],
        "usage_in_dua": "Ya Jabbar, mend our broken hearts and reform our affairs.",
        "display_order": 9
    },
    {
        "id": 10,
        "number": 10,
        "name_arabic": "الْمُتَكَبِّرُ",
        "name_transliteration": "Al-Mutakabbir",
        "name_english": "The Supreme",
        "meaning": "The one who is supreme in greatness and above all creation in majesty.",
        "explanation": "Al-Mutakabbir means Allah alone has the right to absolute greatness and grandeur. He is supremely great beyond anything creation can comprehend. While pride is forbidden for creation, supreme greatness rightfully belongs to Allah alone.",
        "benefits": "Remembering this name fosters humility and reminds one that true greatness belongs only to Allah.",
        "quran_references": ["59:23"],
        "usage_in_dua": "Ya Mutakabbir, we acknowledge Your supreme greatness; protect us from arrogance.",
        "display_order": 10
    },
    {
        "id": 11,
        "number": 11,
        "name_arabic": "الْخَالِقُ",
        "name_transliteration": "Al-Khaliq",
        "name_english": "The Creator",
        "meaning": "The one who creates everything from nothing according to His divine plan.",
        "explanation": "Al-Khaliq refers to Allah's power of creating all things from absolute nothingness. He determines and plans creation before bringing it into existence. Every atom in the universe owes its existence to His creative will.",
        "benefits": "Invoking this name inspires gratitude for the gift of existence and all of creation.",
        "quran_references": ["59:24", "13:16", "39:62"],
        "usage_in_dua": "Ya Khaliq, You created us from nothing; guide us to fulfill the purpose of our creation.",
        "display_order": 11
    },
    {
        "id": 12,
        "number": 12,
        "name_arabic": "الْبَارِئُ",
        "name_transliteration": "Al-Bari'",
        "name_english": "The Evolver",
        "meaning": "The one who brings creation into being with perfect form and proportion.",
        "explanation": "Al-Bari' refers to Allah's act of evolving and producing creation free from any defect or disproportion. After planning creation (Al-Khaliq), He brings it into existence in perfect form. Each creation is made distinct and separate from others.",
        "benefits": "Reciting this name brings appreciation for the perfection and balance found in all of creation.",
        "quran_references": ["59:24", "2:54"],
        "usage_in_dua": "Ya Bari', You fashioned us in perfect form; help us live in harmony with Your creation.",
        "display_order": 12
    },
    {
        "id": 13,
        "number": 13,
        "name_arabic": "الْمُصَوِّرُ",
        "name_transliteration": "Al-Musawwir",
        "name_english": "The Fashioner",
        "meaning": "The one who shapes and designs each creation with unique and distinctive form.",
        "explanation": "Al-Musawwir is the one who gives every creature its unique shape, image, and appearance. He fashions creation in the womb and gives each being its distinctive features. No two creations are exactly alike, reflecting His infinite creativity.",
        "benefits": "Invoking this name cultivates contentment with one's own form and gratitude for Allah's artistic design.",
        "quran_references": ["59:24", "3:6", "7:11"],
        "usage_in_dua": "Ya Musawwir, You gave us our unique forms; make us beautiful in character as well.",
        "display_order": 13
    },
    {
        "id": 14,
        "number": 14,
        "name_arabic": "الْغَفَّارُ",
        "name_transliteration": "Al-Ghaffar",
        "name_english": "The Forgiving",
        "meaning": "The one who forgives sins repeatedly and covers the faults of His servants.",
        "explanation": "Al-Ghaffar denotes Allah's attribute of repeatedly and abundantly forgiving sins. He conceals the faults of His servants and does not expose them. No matter how many times a person sins, Allah's forgiveness is always available to the repentant.",
        "benefits": "Calling upon this name brings relief from guilt and opens the door to Allah's repeated forgiveness.",
        "quran_references": ["20:82", "38:66", "39:5", "71:10"],
        "usage_in_dua": "Ya Ghaffar, forgive our sins, conceal our faults, and accept our repentance.",
        "display_order": 14
    },
    {
        "id": 15,
        "number": 15,
        "name_arabic": "الْقَهَّارُ",
        "name_transliteration": "Al-Qahhar",
        "name_english": "The Subduer",
        "meaning": "The one who dominates and subdues all of creation with irresistible power.",
        "explanation": "Al-Qahhar means Allah is the one who prevails over all things and subdues everything to His will. No force in the universe can resist His power or stand against His decree. He humbles the arrogant and subdues the oppressors.",
        "benefits": "Invoking this name brings strength against oppression and helps overcome difficulties.",
        "quran_references": ["12:39", "13:16", "14:48", "38:65"],
        "usage_in_dua": "Ya Qahhar, subdue the forces of evil and grant us victory over our lower selves.",
        "display_order": 15
    },
    {
        "id": 16,
        "number": 16,
        "name_arabic": "الْوَهَّابُ",
        "name_transliteration": "Al-Wahhab",
        "name_english": "The Bestower",
        "meaning": "The one who gives generously and abundantly without any return or compensation.",
        "explanation": "Al-Wahhab refers to Allah's nature of giving freely, continuously, and without expecting anything in return. His gifts are limitless and given out of pure grace. He bestows blessings upon whom He wills, both material and spiritual.",
        "benefits": "Reciting this name opens the doors of divine generosity and unexpected blessings.",
        "quran_references": ["3:8", "38:9", "38:35"],
        "usage_in_dua": "Ya Wahhab, bestow upon us from Your limitless bounty and grant us beneficial knowledge.",
        "display_order": 16
    },
    {
        "id": 17,
        "number": 17,
        "name_arabic": "الرَّزَّاقُ",
        "name_transliteration": "Ar-Razzaq",
        "name_english": "The Provider",
        "meaning": "The one who provides sustenance and nourishment to all creation without limit.",
        "explanation": "Ar-Razzaq is the ultimate provider of all forms of sustenance, both physical and spiritual. He provides for every living creature, whether they acknowledge Him or not. His provision is guaranteed and reaches every corner of existence.",
        "benefits": "Invoking this name brings trust in Allah's provision and relief from anxiety about sustenance.",
        "quran_references": ["51:58", "62:11", "2:212"],
        "usage_in_dua": "Ya Razzaq, provide for us from sources we cannot imagine and make our sustenance blessed.",
        "display_order": 17
    },
    {
        "id": 18,
        "number": 18,
        "name_arabic": "الْفَتَّاحُ",
        "name_transliteration": "Al-Fattah",
        "name_english": "The Opener",
        "meaning": "The one who opens all doors of mercy, sustenance, and truth for His servants.",
        "explanation": "Al-Fattah refers to Allah's ability to open what is closed, whether it be doors of provision, guidance, or resolution of disputes. He opens the hearts of the faithful to receive guidance and opens pathways where there seem to be none. He is the ultimate judge who opens the way to truth.",
        "benefits": "Calling upon this name helps remove obstacles and opens doors of opportunity and guidance.",
        "quran_references": ["34:26", "35:2"],
        "usage_in_dua": "Ya Fattah, open for us the doors of goodness and remove every obstacle from our path.",
        "display_order": 18
    },
    {
        "id": 19,
        "number": 19,
        "name_arabic": "الْعَلِيمُ",
        "name_transliteration": "Al-Alim",
        "name_english": "The All-Knowing",
        "meaning": "The one whose knowledge encompasses everything, seen and unseen, past, present, and future.",
        "explanation": "Al-Alim signifies Allah's perfect and complete knowledge of all things. Nothing is hidden from Him, whether it is concealed in the depths of the earth or the heavens. His knowledge precedes creation and encompasses every detail of existence.",
        "benefits": "Remembering this name encourages mindfulness and sincerity in all actions.",
        "quran_references": ["2:29", "2:32", "49:16", "64:11"],
        "usage_in_dua": "Ya Alim, You know what is in our hearts; guide us to what is best for us.",
        "display_order": 19
    },
    {
        "id": 20,
        "number": 20,
        "name_arabic": "الْقَابِضُ",
        "name_transliteration": "Al-Qabid",
        "name_english": "The Constrictor",
        "meaning": "The one who withholds and constricts provision or life as He wills.",
        "explanation": "Al-Qabid refers to Allah's power to constrict, withhold, or take away as part of His divine wisdom. He may restrict provision as a test or to redirect His servant. This attribute is always balanced with Al-Basit (The Expander) and operates with perfect wisdom.",
        "benefits": "Understanding this name helps develop patience during times of restriction and trust in Allah's plan.",
        "quran_references": ["2:245"],
        "usage_in_dua": "Ya Qabid, when You withhold from us, grant us patience and understanding of Your wisdom.",
        "display_order": 20
    },
    {
        "id": 21,
        "number": 21,
        "name_arabic": "الْبَاسِطُ",
        "name_transliteration": "Al-Basit",
        "name_english": "The Expander",
        "meaning": "The one who expands and extends provision, relief, and mercy to His creation.",
        "explanation": "Al-Basit refers to Allah's power to expand, extend, and open wide the doors of provision and mercy. He spreads out sustenance generously and opens hearts to receive guidance and joy. This attribute works in harmony with Al-Qabid to maintain balance in creation.",
        "benefits": "Invoking this name brings hope during difficulty and gratitude during times of abundance.",
        "quran_references": ["2:245", "13:26"],
        "usage_in_dua": "Ya Basit, expand our provision, open our hearts to faith, and spread Your mercy upon us.",
        "display_order": 21
    },
    {
        "id": 22,
        "number": 22,
        "name_arabic": "الْخَافِضُ",
        "name_transliteration": "Al-Khafid",
        "name_english": "The Abaser",
        "meaning": "The one who lowers and humbles the arrogant and the disbelievers.",
        "explanation": "Al-Khafid refers to Allah's power to bring down and abase those who are arrogant or rebellious. He humbles tyrants and oppressors and lowers the status of those who transgress. This attribute demonstrates that all honor and disgrace are in Allah's hands alone.",
        "benefits": "Remembering this name encourages humility and serves as a warning against arrogance.",
        "quran_references": ["56:3"],
        "usage_in_dua": "Ya Khafid, humble our egos and protect us from the sin of arrogance.",
        "display_order": 22
    },
    {
        "id": 23,
        "number": 23,
        "name_arabic": "الرَّافِعُ",
        "name_transliteration": "Ar-Rafi'",
        "name_english": "The Exalter",
        "meaning": "The one who raises and elevates whom He wills in rank and status.",
        "explanation": "Ar-Rafi' is the one who elevates the status of His servants, both in this world and the hereafter. He raises the believers in rank through knowledge, faith, and righteous deeds. This attribute is paired with Al-Khafid, showing that all elevation and honor come from Allah.",
        "benefits": "Invoking this name with sincerity can bring elevation in status, knowledge, and spiritual rank.",
        "quran_references": ["56:3", "58:11", "6:83"],
        "usage_in_dua": "Ya Rafi', raise us in knowledge, faith, and good standing among Your righteous servants.",
        "display_order": 23
    },
    {
        "id": 24,
        "number": 24,
        "name_arabic": "الْمُعِزُّ",
        "name_transliteration": "Al-Mu'izz",
        "name_english": "The Honorer",
        "meaning": "The one who grants honor, dignity, and respect to whom He wills.",
        "explanation": "Al-Mu'izz is the one who bestows true honor and dignity upon His servants. Real honor comes only from Allah and is given to those who are faithful and obedient. No one can honor whom Allah has humiliated, and no one can humiliate whom Allah has honored.",
        "benefits": "Calling upon this name invites divine honor and protection from humiliation.",
        "quran_references": ["3:26"],
        "usage_in_dua": "Ya Mu'izz, honor us through obedience to You and protect our dignity.",
        "display_order": 24
    },
    {
        "id": 25,
        "number": 25,
        "name_arabic": "الْمُذِلُّ",
        "name_transliteration": "Al-Mudhill",
        "name_english": "The Humiliator",
        "meaning": "The one who humiliates and disgraces those who defy His commands.",
        "explanation": "Al-Mudhill refers to Allah's power to bring disgrace upon the arrogant, the oppressors, and the defiant. He removes honor from those who are ungrateful or rebellious against His commands. This attribute serves as a reminder that dignity is a gift from Allah that can be withdrawn.",
        "benefits": "Understanding this name fosters humility and gratitude for the honor Allah bestows.",
        "quran_references": ["3:26"],
        "usage_in_dua": "Ya Allah, protect us from disgrace and keep us among those whom You honor.",
        "display_order": 25
    },
    {
        "id": 26,
        "number": 26,
        "name_arabic": "السَّمِيعُ",
        "name_transliteration": "As-Sami'",
        "name_english": "The All-Hearing",
        "meaning": "The one who hears all sounds, prayers, and speech without any limitation.",
        "explanation": "As-Sami' means Allah hears everything, from the quietest whisper to the loudest cry, and from the secret thoughts of the heart to the spoken word. No prayer goes unheard, and no call for help escapes His hearing. His hearing is perfect and encompasses all of creation simultaneously.",
        "benefits": "Invoking this name strengthens the conviction that every prayer and supplication is heard by Allah.",
        "quran_references": ["2:127", "2:137", "17:1", "58:1"],
        "usage_in_dua": "Ya Sami', hear our prayers and respond to our supplications with Your mercy.",
        "display_order": 26
    },
    {
        "id": 27,
        "number": 27,
        "name_arabic": "الْبَصِيرُ",
        "name_transliteration": "Al-Basir",
        "name_english": "The All-Seeing",
        "meaning": "The one who sees all things, visible and invisible, with perfect and complete vision.",
        "explanation": "Al-Basir signifies that Allah sees everything without any limitation. He sees the crawling of a black ant on a dark stone in a dark night. Nothing in the heavens or earth is hidden from His sight, and He sees the innermost conditions of every heart.",
        "benefits": "Remembering this name encourages God-consciousness and sincerity in all deeds, public and private.",
        "quran_references": ["17:1", "40:20", "42:11", "57:4"],
        "usage_in_dua": "Ya Basir, You see our struggles and efforts; guide us and reward our sincerity.",
        "display_order": 27
    },
    {
        "id": 28,
        "number": 28,
        "name_arabic": "الْحَكَمُ",
        "name_transliteration": "Al-Hakam",
        "name_english": "The Judge",
        "meaning": "The one who judges between His creation with absolute truth and justice.",
        "explanation": "Al-Hakam is the supreme judge whose judgments are final, perfect, and absolutely just. He settles all disputes between His creation and no one can overturn His rulings. On the Day of Judgment, He will judge between all people with complete fairness.",
        "benefits": "Invoking this name brings trust in divine justice and patience when facing injustice.",
        "quran_references": ["6:114", "40:48"],
        "usage_in_dua": "Ya Hakam, judge between us and those who wrong us with Your perfect justice.",
        "display_order": 28
    },
    {
        "id": 29,
        "number": 29,
        "name_arabic": "الْعَدْلُ",
        "name_transliteration": "Al-Adl",
        "name_english": "The Just",
        "meaning": "The one who is perfectly just and never wrongs anyone in the slightest.",
        "explanation": "Al-Adl refers to Allah's perfect and absolute justice in all His actions and decrees. He never oppresses anyone, not even by the weight of an atom. His justice encompasses all realms and ensures that every soul receives exactly what it deserves.",
        "benefits": "Remembering this name inspires one to practice justice and fairness in all dealings.",
        "quran_references": ["4:40", "21:47", "41:46"],
        "usage_in_dua": "Ya Adl, establish justice in our lives and make us instruments of Your justice.",
        "display_order": 29
    },
    {
        "id": 30,
        "number": 30,
        "name_arabic": "اللَّطِيفُ",
        "name_transliteration": "Al-Latif",
        "name_english": "The Subtle",
        "meaning": "The one who is gentle, subtle, and aware of the finest details of all things.",
        "explanation": "Al-Latif encompasses two meanings: Allah's complete awareness of the most subtle and hidden matters, and His gentleness and kindness in dealing with His servants. He brings about His will through subtle and often imperceptible means. His care reaches His servants in ways they may not even realize.",
        "benefits": "Invoking this name brings gentle divine care and subtle blessings into one's life.",
        "quran_references": ["6:103", "22:63", "31:16", "42:19", "67:14"],
        "usage_in_dua": "Ya Latif, be gentle with us in our trials and guide us through subtle means to what is best.",
        "display_order": 30
    },
    {
        "id": 31,
        "number": 31,
        "name_arabic": "الْخَبِيرُ",
        "name_transliteration": "Al-Khabir",
        "name_english": "The All-Aware",
        "meaning": "The one who is fully aware of the inner realities and hidden aspects of all things.",
        "explanation": "Al-Khabir means Allah has complete inner knowledge of all things, including the hidden intentions, secrets, and subtle aspects of creation. His awareness penetrates beyond the surface to the deepest reality of every matter. Nothing is concealed from His comprehensive awareness.",
        "benefits": "Remembering this name encourages sincerity and purity of intention in all actions.",
        "quran_references": ["6:18", "31:16", "49:13", "66:3"],
        "usage_in_dua": "Ya Khabir, You know our innermost thoughts; purify our intentions and forgive our hidden faults.",
        "display_order": 31
    },
    {
        "id": 32,
        "number": 32,
        "name_arabic": "الْحَلِيمُ",
        "name_transliteration": "Al-Halim",
        "name_english": "The Forbearing",
        "meaning": "The one who is patient, tolerant, and does not hasten punishment for the disobedient.",
        "explanation": "Al-Halim refers to Allah's immense patience and forbearance with His creation. Despite His full knowledge of their sins and having complete power to punish immediately, He delays punishment to give people time to repent. His forbearance is an expression of His mercy and wisdom.",
        "benefits": "Invoking this name inspires patience and tolerance, and gives hope that Allah's mercy precedes His wrath.",
        "quran_references": ["2:225", "2:235", "2:263", "17:44", "22:59"],
        "usage_in_dua": "Ya Halim, be forbearing with our mistakes and grant us time and ability to repent.",
        "display_order": 32
    },
    {
        "id": 33,
        "number": 33,
        "name_arabic": "الْعَظِيمُ",
        "name_transliteration": "Al-Azim",
        "name_english": "The Magnificent",
        "meaning": "The one who possesses absolute greatness and magnificence beyond comprehension.",
        "explanation": "Al-Azim signifies Allah's supreme greatness and magnificence that surpasses all understanding. His greatness encompasses His essence, attributes, and actions. The human mind cannot fully comprehend the extent of His magnificence.",
        "benefits": "Reciting this name fills the heart with awe and reverence for Allah's limitless greatness.",
        "quran_references": ["2:255", "42:4", "56:96"],
        "usage_in_dua": "Ya Azim, we glorify Your magnificent greatness; make us among those who truly revere You.",
        "display_order": 33
    },
    {
        "id": 34,
        "number": 34,
        "name_arabic": "الْغَفُورُ",
        "name_transliteration": "Al-Ghafur",
        "name_english": "The All-Forgiving",
        "meaning": "The one whose forgiveness is vast and all-encompassing for those who seek it.",
        "explanation": "Al-Ghafur denotes the vastness and completeness of Allah's forgiveness. He not only forgives sins but completely erases them and covers the sinner with His mercy. His forgiveness is available for all sins as long as the servant sincerely repents before death.",
        "benefits": "Calling upon this name brings hope and encourages turning to Allah in sincere repentance.",
        "quran_references": ["2:173", "4:23", "15:49", "39:53", "67:12"],
        "usage_in_dua": "Ya Ghafur, forgive all our sins, major and minor, and replace them with good deeds.",
        "display_order": 34
    },
    {
        "id": 35,
        "number": 35,
        "name_arabic": "الشَّكُورُ",
        "name_transliteration": "Ash-Shakur",
        "name_english": "The Grateful",
        "meaning": "The one who appreciates and abundantly rewards even the smallest good deed.",
        "explanation": "Ash-Shakur means Allah acknowledges, appreciates, and generously rewards even the most insignificant good deed. He multiplies the reward of good actions many times over and never allows any good effort to go unnoticed. His gratitude to His servants far exceeds their devotion to Him.",
        "benefits": "Invoking this name motivates one to perform good deeds, knowing that Allah appreciates every effort.",
        "quran_references": ["35:30", "35:34", "42:23", "64:17"],
        "usage_in_dua": "Ya Shakur, accept our small deeds and multiply their reward through Your generous appreciation.",
        "display_order": 35
    },
    {
        "id": 36,
        "number": 36,
        "name_arabic": "الْعَلِيُّ",
        "name_transliteration": "Al-Aliyy",
        "name_english": "The Most High",
        "meaning": "The one who is the highest and most exalted above all of creation.",
        "explanation": "Al-Aliyy signifies Allah's absolute transcendence and exaltedness above all creation. He is above everything in His essence, attributes, and power. Nothing in creation can rival or approach His supreme highness.",
        "benefits": "Remembering this name elevates the heart and mind toward the divine, fostering spiritual aspiration.",
        "quran_references": ["2:255", "4:34", "22:62", "42:4", "42:51"],
        "usage_in_dua": "Ya Aliyy, elevate our souls toward You and raise us in faith and righteousness.",
        "display_order": 36
    },
    {
        "id": 37,
        "number": 37,
        "name_arabic": "الْكَبِيرُ",
        "name_transliteration": "Al-Kabir",
        "name_english": "The Great",
        "meaning": "The one who is greater than everything in existence and beyond all comparison.",
        "explanation": "Al-Kabir means Allah is the greatest being, surpassing all creation in every attribute. His greatness is absolute and cannot be measured or compared to anything. Everything in existence is insignificant before His supreme greatness.",
        "benefits": "Invoking this name puts worldly matters in perspective and strengthens reliance on Allah.",
        "quran_references": ["4:34", "13:9", "22:62", "31:30", "34:23"],
        "usage_in_dua": "Ya Kabir, You are greater than all our problems; help us overcome our challenges.",
        "display_order": 37
    },
    {
        "id": 38,
        "number": 38,
        "name_arabic": "الْحَفِيظُ",
        "name_transliteration": "Al-Hafiz",
        "name_english": "The Preserver",
        "meaning": "The one who preserves and protects all of creation from harm and destruction.",
        "explanation": "Al-Hafiz refers to Allah's attribute of preserving and guarding all of existence. He protects the heavens and earth from collapse, preserves every deed in His record, and guards His servants from harm. He also preserves the Quran from alteration until the end of time.",
        "benefits": "Calling upon this name brings divine protection and preservation from physical and spiritual harm.",
        "quran_references": ["11:57", "12:64", "15:9", "34:21", "42:6"],
        "usage_in_dua": "Ya Hafiz, preserve us from all evil, protect our faith, and guard our families.",
        "display_order": 38
    },
    {
        "id": 39,
        "number": 39,
        "name_arabic": "الْمُقِيتُ",
        "name_transliteration": "Al-Muqit",
        "name_english": "The Sustainer",
        "meaning": "The one who sustains and nourishes all creation with what they need.",
        "explanation": "Al-Muqit refers to Allah's attribute of sustaining and maintaining all of creation. He provides the precise amount of nourishment, both physical and spiritual, that every creature needs. He oversees and has power over all things while ensuring their sustenance.",
        "benefits": "Invoking this name brings contentment and trust that Allah will provide exactly what is needed.",
        "quran_references": ["4:85"],
        "usage_in_dua": "Ya Muqit, sustain us with what we need in body, mind, and soul.",
        "display_order": 39
    },
    {
        "id": 40,
        "number": 40,
        "name_arabic": "الْحَسِيبُ",
        "name_transliteration": "Al-Hasib",
        "name_english": "The Reckoner",
        "meaning": "The one who takes account of all deeds and is sufficient for His servants.",
        "explanation": "Al-Hasib has a dual meaning: Allah is the one who will call every soul to account for its deeds, and He is also sufficient as a protector and supporter for His servants. He keeps a precise record of every action and will bring each person to account with perfect justice.",
        "benefits": "Remembering this name encourages accountability and trust that Allah is sufficient for all needs.",
        "quran_references": ["4:6", "4:86", "33:39"],
        "usage_in_dua": "Ya Hasib, You are sufficient for us; protect us and be our guardian in all matters.",
        "display_order": 40
    },
    {
        "id": 41,
        "number": 41,
        "name_arabic": "الْجَلِيلُ",
        "name_transliteration": "Al-Jalil",
        "name_english": "The Majestic",
        "meaning": "The one who possesses absolute majesty, grandeur, and sublime glory.",
        "explanation": "Al-Jalil signifies Allah's overwhelming majesty and grandeur that inspires awe and reverence. His majesty is evident in every aspect of creation and in His divine attributes. He is the Lord of majesty and honor, deserving of the utmost respect and glorification.",
        "benefits": "Invoking this name fills the heart with reverence and awe for Allah's sublime majesty.",
        "quran_references": ["55:27", "55:78"],
        "usage_in_dua": "Ya Jalil, fill our hearts with reverence for Your majesty and make us among the humble.",
        "display_order": 41
    },
    {
        "id": 42,
        "number": 42,
        "name_arabic": "الْكَرِيمُ",
        "name_transliteration": "Al-Karim",
        "name_english": "The Generous",
        "meaning": "The one who is the most generous, noble, and bountiful in giving.",
        "explanation": "Al-Karim refers to Allah's boundless generosity and nobility. He gives without being asked, forgives without being begged, and fulfills promises without fail. His generosity extends to all creation and is not diminished by His constant giving.",
        "benefits": "Calling upon this name attracts divine generosity and inspires one to be generous with others.",
        "quran_references": ["27:40", "82:6", "96:3"],
        "usage_in_dua": "Ya Karim, shower us with Your generous blessings and make us generous to others.",
        "display_order": 42
    },
    {
        "id": 43,
        "number": 43,
        "name_arabic": "الرَّقِيبُ",
        "name_transliteration": "Ar-Raqib",
        "name_english": "The Watchful",
        "meaning": "The one who watches over all things with constant and complete attention.",
        "explanation": "Ar-Raqib means Allah is ever-watchful over His creation, monitoring every action, word, and thought. Nothing escapes His watchful eye, and He is aware of everything at all times. His watchfulness is both a source of comfort for the faithful and a deterrent from sin.",
        "benefits": "Remembering this name develops God-consciousness and encourages righteous behavior at all times.",
        "quran_references": ["4:1", "5:117", "33:52"],
        "usage_in_dua": "Ya Raqib, make us mindful of Your watchful presence and guide us to righteous conduct.",
        "display_order": 43
    },
    {
        "id": 44,
        "number": 44,
        "name_arabic": "الْمُجِيبُ",
        "name_transliteration": "Al-Mujib",
        "name_english": "The Responsive",
        "meaning": "The one who responds to the prayers and calls of His servants.",
        "explanation": "Al-Mujib is the one who answers every supplication and responds to every call for help. He may respond by giving what is asked, replacing it with something better, or averting harm. No sincere prayer goes unanswered, though the response may come in unexpected ways.",
        "benefits": "Invoking this name strengthens trust in prayer and confidence that Allah hears and responds.",
        "quran_references": ["2:186", "11:61", "37:75"],
        "usage_in_dua": "Ya Mujib, respond to our prayers and grant us what is best in this life and the next.",
        "display_order": 44
    },
    {
        "id": 45,
        "number": 45,
        "name_arabic": "الْوَاسِعُ",
        "name_transliteration": "Al-Wasi'",
        "name_english": "The All-Encompassing",
        "meaning": "The one whose knowledge, mercy, and provision encompass all things.",
        "explanation": "Al-Wasi' signifies that Allah's attributes, particularly His knowledge, mercy, and generosity, are vast and all-encompassing. His capacity is unlimited and He is never constrained. He encompasses all of creation with His knowledge, mercy, and provisions.",
        "benefits": "Reciting this name broadens one's perspective and trust in Allah's unlimited capacity.",
        "quran_references": ["2:115", "2:247", "2:261", "3:73", "5:54"],
        "usage_in_dua": "Ya Wasi', expand our hearts with faith and encompass us with Your vast mercy.",
        "display_order": 45
    },
    {
        "id": 46,
        "number": 46,
        "name_arabic": "الْحَكِيمُ",
        "name_transliteration": "Al-Hakim",
        "name_english": "The Wise",
        "meaning": "The one who possesses perfect wisdom in all His decisions and actions.",
        "explanation": "Al-Hakim means Allah acts with absolute wisdom in everything He decrees and creates. There is profound purpose and perfect reason behind every aspect of creation and every divine decree. His wisdom ensures that everything is placed in its proper place at the proper time.",
        "benefits": "Invoking this name brings acceptance of divine decree and trust that there is wisdom behind every event.",
        "quran_references": ["2:32", "2:129", "31:27", "59:24"],
        "usage_in_dua": "Ya Hakim, grant us understanding of Your wisdom and help us accept Your divine decrees.",
        "display_order": 46
    },
    {
        "id": 47,
        "number": 47,
        "name_arabic": "الْوَدُودُ",
        "name_transliteration": "Al-Wadud",
        "name_english": "The Loving",
        "meaning": "The one who is the source of all love and who loves His righteous servants.",
        "explanation": "Al-Wadud refers to Allah's deep, active love for His servants. His love is not passive but manifests in kindness, mercy, and care for those who turn to Him. He places love between people's hearts and loves those who follow His guidance and repent sincerely.",
        "benefits": "Calling upon this name attracts divine love and cultivates love in relationships.",
        "quran_references": ["11:90", "85:14"],
        "usage_in_dua": "Ya Wadud, fill our hearts with Your love and the love of those who love You.",
        "display_order": 47
    },
    {
        "id": 48,
        "number": 48,
        "name_arabic": "الْمَجِيدُ",
        "name_transliteration": "Al-Majid",
        "name_english": "The Glorious",
        "meaning": "The one who possesses perfect glory, nobility, and exalted honor.",
        "explanation": "Al-Majid combines the meanings of supreme glory, generosity, and nobility. Allah's glory is manifest in His perfect attributes and His generous dealings with creation. He is the most glorious in His essence and the most noble in His actions.",
        "benefits": "Invoking this name inspires one to strive for noble character and seek Allah's glorious favor.",
        "quran_references": ["11:73", "85:15"],
        "usage_in_dua": "Ya Majid, honor us with Your glory and grant us noble character.",
        "display_order": 48
    },
    {
        "id": 49,
        "number": 49,
        "name_arabic": "الْبَاعِثُ",
        "name_transliteration": "Al-Ba'ith",
        "name_english": "The Resurrector",
        "meaning": "The one who resurrects the dead and raises all creation on the Day of Judgment.",
        "explanation": "Al-Ba'ith refers to Allah's power to resurrect the dead and bring them back to life for judgment. He raises people from their graves on the Day of Judgment to be held accountable. He also sends prophets and messengers to awaken humanity from heedlessness.",
        "benefits": "Remembering this name strengthens belief in the afterlife and motivates preparation for the Day of Judgment.",
        "quran_references": ["22:7", "16:89", "2:56"],
        "usage_in_dua": "Ya Ba'ith, resurrect our hearts from heedlessness and prepare us for the Day we meet You.",
        "display_order": 49
    },
    {
        "id": 50,
        "number": 50,
        "name_arabic": "الشَّهِيدُ",
        "name_transliteration": "Ash-Shahid",
        "name_english": "The Witness",
        "meaning": "The one who witnesses all things and from whom nothing is hidden.",
        "explanation": "Ash-Shahid means Allah is a witness over all things that occur in creation. He observes every action, hears every word, and knows every thought. On the Day of Judgment, He will testify as the ultimate witness regarding what His servants did.",
        "benefits": "Invoking this name encourages sincerity and integrity, knowing that Allah witnesses everything.",
        "quran_references": ["4:33", "4:166", "22:17", "41:53", "85:9"],
        "usage_in_dua": "Ya Shahid, You witness all that we do; help us live with integrity and sincerity.",
        "display_order": 50
    },
    {
        "id": 51,
        "number": 51,
        "name_arabic": "الْحَقُّ",
        "name_transliteration": "Al-Haqq",
        "name_english": "The Truth",
        "meaning": "The one whose existence is undeniably true and real.",
        "explanation": "Al-Haqq is the ultimate reality. Allah's existence is the absolute truth upon which all other existence depends. Everything He decrees and legislates is truth.",
        "benefits": "Reflecting on this name strengthens certainty in faith and removes doubts.",
        "quran_references": ["22:6", "31:30"],
        "usage_in_dua": "Ya Haqq, show us the truth as truth and help us follow it.",
        "display_order": 51
    },
    {
        "id": 52,
        "number": 52,
        "name_arabic": "الْوَكِيلُ",
        "name_transliteration": "Al-Wakil",
        "name_english": "The Trustee",
        "meaning": "The one who is the ultimate trustee and disposer of affairs.",
        "explanation": "Al-Wakil is the one upon whom all matters can be entrusted. He is sufficient for those who rely on Him and He manages all affairs with perfect wisdom. Tawakkul (reliance on Allah) is built upon this name.",
        "benefits": "Invoking this name brings peace of mind and reliance upon Allah in all matters.",
        "quran_references": ["3:173", "33:3", "73:9"],
        "usage_in_dua": "Ya Wakil, I entrust all my affairs to You.",
        "display_order": 52
    },
    {
        "id": 53,
        "number": 53,
        "name_arabic": "الْقَوِيُّ",
        "name_transliteration": "Al-Qawiyy",
        "name_english": "The Strong",
        "meaning": "The one who possesses unlimited and perfect strength.",
        "explanation": "Al-Qawiyy is the possessor of absolute power and strength that never diminishes. His strength is beyond comparison, and nothing can overpower Him. He supports the believers with His strength.",
        "benefits": "Remembering this name provides courage and confidence in facing difficulties.",
        "quran_references": ["22:40", "22:74", "42:19"],
        "usage_in_dua": "Ya Qawiyy, grant me strength to uphold Your religion.",
        "display_order": 53
    },
    {
        "id": 54,
        "number": 54,
        "name_arabic": "الْمَتِينُ",
        "name_transliteration": "Al-Matin",
        "name_english": "The Firm",
        "meaning": "The one whose power is firm and unshakeable.",
        "explanation": "Al-Matin indicates that Allah's strength is steadfast and His grip is unbreakable. He is firm in His essence and attributes, and nothing can weaken His authority. His plans are executed with absolute firmness.",
        "benefits": "Reflecting on this name provides steadfastness and resolve in worship.",
        "quran_references": ["51:58"],
        "usage_in_dua": "Ya Matin, make me firm upon Your straight path.",
        "display_order": 54
    },
    {
        "id": 55,
        "number": 55,
        "name_arabic": "الْوَلِيُّ",
        "name_transliteration": "Al-Waliyy",
        "name_english": "The Protector",
        "meaning": "The one who is the protecting friend and supporter of the believers.",
        "explanation": "Al-Waliyy is the one who lovingly supports and protects His believing servants. He is close to them, aids them, and manages their affairs. His wilayah (guardianship) is the source of all honor and protection.",
        "benefits": "Calling upon this name nurtures a sense of closeness and divine protection.",
        "quran_references": ["2:257", "42:9", "45:19"],
        "usage_in_dua": "Ya Waliyy, be my protector in this world and the next.",
        "display_order": 55
    },
    {
        "id": 56,
        "number": 56,
        "name_arabic": "الْحَمِيدُ",
        "name_transliteration": "Al-Hamid",
        "name_english": "The Praiseworthy",
        "meaning": "The one who is worthy of all praise and commendation.",
        "explanation": "Al-Hamid is praiseworthy in His essence, names, attributes, and actions. He is praised whether or not His servants praise Him. All praise ultimately returns to Him, for every blessing originates from Him.",
        "benefits": "Reflecting on this name cultivates gratitude and the habit of praising Allah.",
        "quran_references": ["14:1", "14:8", "31:12"],
        "usage_in_dua": "Ya Hamid, make me among those who praise You in all circumstances.",
        "display_order": 56
    },
    {
        "id": 57,
        "number": 57,
        "name_arabic": "الْمُحْصِي",
        "name_transliteration": "Al-Muhsi",
        "name_english": "The All-Enumerating",
        "meaning": "The one who counts and knows the number of everything in existence.",
        "explanation": "Al-Muhsi has complete knowledge of every detail and number of all things. Nothing escapes His count, from the grains of sand to the deeds of every soul. He will bring every deed to account on the Day of Judgment.",
        "benefits": "Awareness of this name encourages mindfulness and accountability in all actions.",
        "quran_references": ["19:94", "72:28", "58:6"],
        "usage_in_dua": "Ya Muhsi, make my good deeds plentiful in Your count.",
        "display_order": 57
    },
    {
        "id": 58,
        "number": 58,
        "name_arabic": "الْمُبْدِئُ",
        "name_transliteration": "Al-Mubdi'",
        "name_english": "The Originator",
        "meaning": "The one who creates all things from nothing for the first time.",
        "explanation": "Al-Mubdi' originates creation without any prior model or material. He brought the universe into existence from absolute nothingness. His creative power is unmatched and requires no precedent.",
        "benefits": "Reflecting on this name inspires awe at the originality of creation.",
        "quran_references": ["10:4", "29:19", "85:13"],
        "usage_in_dua": "Ya Mubdi', originate goodness in my life and renew my faith.",
        "display_order": 58
    },
    {
        "id": 59,
        "number": 59,
        "name_arabic": "الْمُعِيدُ",
        "name_transliteration": "Al-Mu'id",
        "name_english": "The Restorer",
        "meaning": "The one who restores creation after its extinction.",
        "explanation": "Al-Mu'id will bring back all of creation on the Day of Resurrection. Just as He originated creation the first time, He will restore it with equal ease. This name affirms the reality of the afterlife.",
        "benefits": "Belief in this name strengthens conviction in the resurrection and accountability.",
        "quran_references": ["10:4", "29:19", "30:11"],
        "usage_in_dua": "Ya Mu'id, restore me to a state of righteousness.",
        "display_order": 59
    },
    {
        "id": 60,
        "number": 60,
        "name_arabic": "الْمُحْيِي",
        "name_transliteration": "Al-Muhyi",
        "name_english": "The Giver of Life",
        "meaning": "The one who gives life to the lifeless and brings the dead to life.",
        "explanation": "Al-Muhyi grants life in all its forms: physical life to bodies, spiritual life to hearts through guidance, and life to the earth through rain. He alone has the power to bring about life from death.",
        "benefits": "Calling upon this name revitalizes hope and seeks spiritual awakening.",
        "quran_references": ["30:50", "41:39", "2:258"],
        "usage_in_dua": "Ya Muhyi, give life to my heart with Your remembrance.",
        "display_order": 60
    },
    {
        "id": 61,
        "number": 61,
        "name_arabic": "الْمُمِيتُ",
        "name_transliteration": "Al-Mumit",
        "name_english": "The Bringer of Death",
        "meaning": "The one who creates death and takes away life at the appointed time.",
        "explanation": "Al-Mumit decrees death for all living creatures at their appointed time. No soul can escape death, and no one can delay it. This name reminds us of the temporary nature of this worldly life.",
        "benefits": "Awareness of this name encourages preparation for the afterlife and detachment from worldly excess.",
        "quran_references": ["3:156", "7:158", "15:23"],
        "usage_in_dua": "Ya Mumit, let me die upon faith and in a state pleasing to You.",
        "display_order": 61
    },
    {
        "id": 62,
        "number": 62,
        "name_arabic": "الْحَيُّ",
        "name_transliteration": "Al-Hayy",
        "name_english": "The Ever-Living",
        "meaning": "The one who has perfect, eternal life that never ends.",
        "explanation": "Al-Hayy possesses perfect and eternal life. His life has no beginning and no end, unlike the temporary life of His creation. All other living things derive their life from Him, and He sustains them all.",
        "benefits": "Invoking this name brings hope and reminds one to rely on the Ever-Living who never dies.",
        "quran_references": ["2:255", "3:2", "20:111", "25:58"],
        "usage_in_dua": "Ya Hayy, Ya Qayyum, with Your mercy I seek help.",
        "display_order": 62
    },
    {
        "id": 63,
        "number": 63,
        "name_arabic": "الْقَيُّومُ",
        "name_transliteration": "Al-Qayyum",
        "name_english": "The Self-Subsisting",
        "meaning": "The one who sustains Himself and sustains all of creation.",
        "explanation": "Al-Qayyum is self-existing and sustains everything in the heavens and earth. He neither slumbers nor sleeps, and all creation is entirely dependent on Him. Without His sustaining, nothing would continue to exist.",
        "benefits": "Reflecting on this name strengthens reliance on Allah and awareness of His sustaining power.",
        "quran_references": ["2:255", "3:2", "20:111"],
        "usage_in_dua": "Ya Qayyum, sustain me in my faith and my affairs.",
        "display_order": 63
    },
    {
        "id": 64,
        "number": 64,
        "name_arabic": "الْوَاجِدُ",
        "name_transliteration": "Al-Wajid",
        "name_english": "The Finder",
        "meaning": "The one who finds whatever He wills and lacks nothing.",
        "explanation": "Al-Wajid is the one who has no needs and who finds everything He desires. Nothing is lost to Him or beyond His reach. He is completely self-sufficient and possesses all things.",
        "benefits": "Calling upon this name helps in finding what is lost and fulfilling needs.",
        "quran_references": ["93:6", "93:7", "93:8"],
        "usage_in_dua": "Ya Wajid, help me find guidance and provision in Your grace.",
        "display_order": 64
    },
    {
        "id": 65,
        "number": 65,
        "name_arabic": "الْمَاجِدُ",
        "name_transliteration": "Al-Majid",
        "name_english": "The Noble",
        "meaning": "The one whose glory and nobility are most great and abundant.",
        "explanation": "Al-Majid combines greatness with generosity. His attributes are noble and His actions are magnanimous. He is glorified in His essence and generous beyond measure in His giving.",
        "benefits": "Reflecting on this name inspires nobility of character and generosity.",
        "quran_references": ["11:73", "85:15"],
        "usage_in_dua": "Ya Majid, bless me with noble character and generous provision.",
        "display_order": 65
    },
    {
        "id": 66,
        "number": 66,
        "name_arabic": "الْوَاحِدُ",
        "name_transliteration": "Al-Wahid",
        "name_english": "The One",
        "meaning": "The one and only God, unique in His divinity.",
        "explanation": "Al-Wahid affirms that Allah is one in His lordship, worship, and names and attributes. There is no partner, equal, or rival to Him. He alone deserves to be worshipped.",
        "benefits": "This name purifies one's belief in the oneness of Allah (Tawhid).",
        "quran_references": ["2:163", "13:16", "14:52", "38:65"],
        "usage_in_dua": "Ya Wahid, purify my heart from associating anything with You.",
        "display_order": 66
    },
    {
        "id": 67,
        "number": 67,
        "name_arabic": "الْأَحَدُ",
        "name_transliteration": "Al-Ahad",
        "name_english": "The Unique",
        "meaning": "The absolutely unique one who is indivisible and incomparable.",
        "explanation": "Al-Ahad emphasizes the absolute uniqueness of Allah. He is not composed of parts and cannot be divided. Nothing resembles Him in any way, and He has no equal in His perfection.",
        "benefits": "Reflecting on this name deepens understanding of Allah's absolute uniqueness.",
        "quran_references": ["112:1"],
        "usage_in_dua": "Ya Ahad, I bear witness that there is none like You.",
        "display_order": 67
    },
    {
        "id": 68,
        "number": 68,
        "name_arabic": "الصَّمَدُ",
        "name_transliteration": "As-Samad",
        "name_english": "The Eternal Refuge",
        "meaning": "The one to whom all creation turns in their needs.",
        "explanation": "As-Samad is the master who is relied upon in all matters. He is perfect in His attributes and all creation depends on Him. He does not eat, drink, or have any needs, yet all beings need Him.",
        "benefits": "Calling upon this name directs one's needs and dependence entirely to Allah.",
        "quran_references": ["112:2"],
        "usage_in_dua": "Ya Samad, I turn to You alone for all my needs.",
        "display_order": 68
    },
    {
        "id": 69,
        "number": 69,
        "name_arabic": "الْقَادِرُ",
        "name_transliteration": "Al-Qadir",
        "name_english": "The Able",
        "meaning": "The one who has complete power and ability over all things.",
        "explanation": "Al-Qadir has absolute power to do whatever He wills. Nothing is difficult for Him, and He creates and commands with perfect ability. His power encompasses all things without exception.",
        "benefits": "Reflecting on this name instills trust in Allah's power to change any situation.",
        "quran_references": ["6:65", "36:81", "46:33", "75:40"],
        "usage_in_dua": "Ya Qadir, You have power over all things; grant me what is good.",
        "display_order": 69
    },
    {
        "id": 70,
        "number": 70,
        "name_arabic": "الْمُقْتَدِرُ",
        "name_transliteration": "Al-Muqtadir",
        "name_english": "The Powerful",
        "meaning": "The one who exercises absolute power and authority over creation.",
        "explanation": "Al-Muqtadir is the one whose power prevails over all things. He subjects creation to His will and none can resist His decree. This name emphasizes the active exercise of divine power.",
        "benefits": "Awareness of this name brings humility before Allah's overwhelming power.",
        "quran_references": ["18:45", "54:42", "54:55"],
        "usage_in_dua": "Ya Muqtadir, subject my desires to Your obedience.",
        "display_order": 70
    },
    {
        "id": 71,
        "number": 71,
        "name_arabic": "الْمُقَدِّمُ",
        "name_transliteration": "Al-Muqaddim",
        "name_english": "The Expediter",
        "meaning": "The one who brings forward whomever and whatever He wills.",
        "explanation": "Al-Muqaddim advances and gives precedence to whom He wills. He elevates certain people, places, and times above others according to His wisdom. He brings forward the causes of good for His servants.",
        "benefits": "Invoking this name helps seek advancement in matters of faith and worldly good.",
        "quran_references": ["50:28", "16:61"],
        "usage_in_dua": "Ya Muqaddim, bring me closer to You and advance me in goodness.",
        "display_order": 71
    },
    {
        "id": 72,
        "number": 72,
        "name_arabic": "الْمُؤَخِّرُ",
        "name_transliteration": "Al-Mu'akhkhir",
        "name_english": "The Delayer",
        "meaning": "The one who delays and puts back whomever and whatever He wills.",
        "explanation": "Al-Mu'akhkhir postpones things according to His wisdom and plan. He may delay punishment to allow repentance, or delay blessings until the best time. Nothing is delayed without divine purpose.",
        "benefits": "Understanding this name cultivates patience and trust in Allah's timing.",
        "quran_references": ["14:42", "71:4"],
        "usage_in_dua": "Ya Mu'akhkhir, distance me from sin and transgression.",
        "display_order": 72
    },
    {
        "id": 73,
        "number": 73,
        "name_arabic": "الْأَوَّلُ",
        "name_transliteration": "Al-Awwal",
        "name_english": "The First",
        "meaning": "The one who existed before everything and has no beginning.",
        "explanation": "Al-Awwal is the first without a beginning. Nothing preceded Him and He existed when nothing else did. His existence is eternal and has no starting point, affirming His absolute transcendence over time.",
        "benefits": "Reflecting on this name reminds one that Allah is the origin of all existence.",
        "quran_references": ["57:3"],
        "usage_in_dua": "Ya Awwal, You are before all things; guide me from the start of every matter.",
        "display_order": 73
    },
    {
        "id": 74,
        "number": 74,
        "name_arabic": "الْآخِرُ",
        "name_transliteration": "Al-Akhir",
        "name_english": "The Last",
        "meaning": "The one who remains after everything perishes and has no end.",
        "explanation": "Al-Akhir is the last without an end. He will remain after all of creation ceases to exist. His eternal existence continues beyond the end of time and all created things.",
        "benefits": "This name reminds one that only Allah is permanent and everything else is temporary.",
        "quran_references": ["57:3"],
        "usage_in_dua": "Ya Akhir, make my last deeds my best deeds.",
        "display_order": 74
    },
    {
        "id": 75,
        "number": 75,
        "name_arabic": "الظَّاهِرُ",
        "name_transliteration": "Az-Zahir",
        "name_english": "The Manifest",
        "meaning": "The one whose existence is evident through His signs.",
        "explanation": "Az-Zahir is manifest and apparent through the signs of His creation. His existence is proven by everything that exists, yet He is above and beyond all creation. The entire universe testifies to His presence.",
        "benefits": "Reflecting on this name opens one's eyes to the signs of Allah everywhere.",
        "quran_references": ["57:3"],
        "usage_in_dua": "Ya Zahir, make Your guidance apparent in my life.",
        "display_order": 75
    },
    {
        "id": 76,
        "number": 76,
        "name_arabic": "الْبَاطِنُ",
        "name_transliteration": "Al-Batin",
        "name_english": "The Hidden",
        "meaning": "The one who is hidden from the senses yet knows all that is hidden.",
        "explanation": "Al-Batin is imperceptible to the senses in this life, yet He is closer to us than our jugular vein. He knows every secret, hidden thought, and concealed matter. His knowledge penetrates all that is hidden.",
        "benefits": "Awareness of this name encourages sincerity and mindfulness of Allah's closeness.",
        "quran_references": ["57:3", "50:16"],
        "usage_in_dua": "Ya Batin, purify my inner self and my hidden intentions.",
        "display_order": 76
    },
    {
        "id": 77,
        "number": 77,
        "name_arabic": "الْوَالِي",
        "name_transliteration": "Al-Wali",
        "name_english": "The Governor",
        "meaning": "The one who governs and manages all affairs of creation.",
        "explanation": "Al-Wali is the governing lord who owns all things and manages all affairs. His governance is perfect and encompasses everything in existence. Nothing in the heavens or earth escapes His administration.",
        "benefits": "Reflecting on this name encourages surrender to Allah's governance and plan.",
        "quran_references": ["13:11", "22:7"],
        "usage_in_dua": "Ya Wali, govern my affairs with Your wisdom and mercy.",
        "display_order": 77
    },
    {
        "id": 78,
        "number": 78,
        "name_arabic": "الْمُتَعَالِي",
        "name_transliteration": "Al-Muta'ali",
        "name_english": "The Most Exalted",
        "meaning": "The one who is exalted above all creation in every way.",
        "explanation": "Al-Muta'ali is supremely exalted above everything. He is above all defects, above any description that does not befit Him, and above any comparison. His transcendence is absolute and perfect.",
        "benefits": "This name inspires glorification and awe of Allah's supreme majesty.",
        "quran_references": ["13:9"],
        "usage_in_dua": "Ya Muta'ali, elevate my rank with You and purify my worship.",
        "display_order": 78
    },
    {
        "id": 79,
        "number": 79,
        "name_arabic": "الْبَرُّ",
        "name_transliteration": "Al-Barr",
        "name_english": "The Source of Goodness",
        "meaning": "The one who is the source of all goodness, kindness, and righteousness.",
        "explanation": "Al-Barr is the source of every type of goodness and benevolence. His kindness extends to all creatures, and He treats His servants with gentleness and grace. He rewards even small acts of obedience abundantly.",
        "benefits": "Calling upon this name opens the door to experiencing Allah's endless kindness.",
        "quran_references": ["52:28"],
        "usage_in_dua": "Ya Barr, envelop me in Your goodness and kindness.",
        "display_order": 79
    },
    {
        "id": 80,
        "number": 80,
        "name_arabic": "التَّوَّابُ",
        "name_transliteration": "At-Tawwab",
        "name_english": "The Acceptor of Repentance",
        "meaning": "The one who repeatedly accepts repentance and turns toward His servants in mercy.",
        "explanation": "At-Tawwab is the one who guides His servants to repent, then accepts their repentance. He turns toward them with mercy before they even turn to Him. No matter how many times one repents sincerely, He accepts it.",
        "benefits": "This name provides immense hope for those who have sinned and seek forgiveness.",
        "quran_references": ["2:37", "2:128", "4:64", "49:12", "110:3"],
        "usage_in_dua": "Ya Tawwab, accept my repentance and turn to me with mercy.",
        "display_order": 80
    },
    {
        "id": 81,
        "number": 81,
        "name_arabic": "الْمُنْتَقِمُ",
        "name_transliteration": "Al-Muntaqim",
        "name_english": "The Avenger",
        "meaning": "The one who justly punishes the wrongdoers and oppressors.",
        "explanation": "Al-Muntaqim takes retribution against those who persist in tyranny and disobedience. His vengeance is based on justice, not cruelty. He may delay punishment, but He does not neglect it for the unrepentant.",
        "benefits": "Awareness of this name deters one from oppression and injustice.",
        "quran_references": ["32:22", "43:41", "44:16"],
        "usage_in_dua": "Ya Muntaqim, protect me from oppression and do not make me among the wrongdoers.",
        "display_order": 81
    },
    {
        "id": 82,
        "number": 82,
        "name_arabic": "الْعَفُوُّ",
        "name_transliteration": "Al-Afuww",
        "name_english": "The Pardoner",
        "meaning": "The one who pardons and erases sins completely.",
        "explanation": "Al-Afuww not only forgives sins but completely erases them as if they never occurred. His pardoning goes beyond mere forgiveness; He wipes the slate clean. He loves to pardon and delights in the repentance of His servants.",
        "benefits": "Invoking this name, especially in the last ten nights of Ramadan, brings complete pardon.",
        "quran_references": ["4:43", "4:99", "4:149", "22:60"],
        "usage_in_dua": "Allahumma innaka Afuwwun tuhibbul-afwa fa'fu anni (O Allah, You are the Pardoner who loves to pardon, so pardon me).",
        "display_order": 82
    },
    {
        "id": 83,
        "number": 83,
        "name_arabic": "الرَّءُوفُ",
        "name_transliteration": "Ar-Ra'uf",
        "name_english": "The Compassionate",
        "meaning": "The one who is full of tender compassion and kindness.",
        "explanation": "Ar-Ra'uf possesses the deepest and most tender form of mercy. His compassion prevents hardship from befalling His servants and eases their burdens. This name conveys an even more intense and personal mercy than Ar-Rahman.",
        "benefits": "Reflecting on this name brings comfort and assurance of Allah's tender care.",
        "quran_references": ["2:143", "2:207", "3:30", "9:117", "24:20"],
        "usage_in_dua": "Ya Ra'uf, have compassion on me in my weakness and difficulty.",
        "display_order": 83
    },
    {
        "id": 84,
        "number": 84,
        "name_arabic": "مَالِكُ الْمُلْكِ",
        "name_transliteration": "Malik-ul-Mulk",
        "name_english": "Owner of All Sovereignty",
        "meaning": "The one who owns all sovereignty and dominion absolutely.",
        "explanation": "Malik-ul-Mulk possesses complete ownership and authority over all kingdoms and realms. He gives sovereignty to whom He wills and takes it from whom He wills. All power and authority in the universe belong to Him alone.",
        "benefits": "This name teaches detachment from worldly power and recognition of Allah's ultimate ownership.",
        "quran_references": ["3:26"],
        "usage_in_dua": "Ya Malik-ul-Mulk, grant me contentment with what You have decreed for me.",
        "display_order": 84
    },
    {
        "id": 85,
        "number": 85,
        "name_arabic": "ذُو الْجَلَالِ وَالْإِكْرَامِ",
        "name_transliteration": "Dhul-Jalali wal-Ikram",
        "name_english": "Lord of Majesty and Generosity",
        "meaning": "The one who possesses both awe-inspiring majesty and boundless generosity.",
        "explanation": "Dhul-Jalali wal-Ikram combines grandeur that inspires reverence with generosity that inspires love. He is majestic in His essence and generous in His dealings with creation. He is worthy of being honored and never denied.",
        "benefits": "Frequently repeating this name is recommended, as the Prophet instructed to persist in calling upon Dhul-Jalali wal-Ikram.",
        "quran_references": ["55:27", "55:78"],
        "usage_in_dua": "Ya Dhal-Jalali wal-Ikram, honor me with Your closeness.",
        "display_order": 85
    },
    {
        "id": 86,
        "number": 86,
        "name_arabic": "الْمُقْسِطُ",
        "name_transliteration": "Al-Muqsit",
        "name_english": "The Equitable",
        "meaning": "The one who acts with perfect justice and equity.",
        "explanation": "Al-Muqsit establishes justice and fairness in all matters. He judges between His servants with perfect equity, never wronging anyone. He loves those who act justly and commands justice in all dealings.",
        "benefits": "Reflecting on this name inspires one to be just and fair in all dealings.",
        "quran_references": ["3:18", "21:47", "49:9"],
        "usage_in_dua": "Ya Muqsit, grant me justice and make me just toward others.",
        "display_order": 86
    },
    {
        "id": 87,
        "number": 87,
        "name_arabic": "الْجَامِعُ",
        "name_transliteration": "Al-Jami'",
        "name_english": "The Gatherer",
        "meaning": "The one who gathers all creation together on the Day of Judgment.",
        "explanation": "Al-Jami' will gather all of humanity for the final reckoning. He also gathers hearts, unites people, and brings together what is scattered. His knowledge gathers all things, and nothing is lost to Him.",
        "benefits": "Invoking this name seeks unity and reminds one of the inevitable gathering.",
        "quran_references": ["3:9", "4:140", "42:29"],
        "usage_in_dua": "Ya Jami', gather me with the righteous on the Day of Judgment.",
        "display_order": 87
    },
    {
        "id": 88,
        "number": 88,
        "name_arabic": "الْغَنِيُّ",
        "name_transliteration": "Al-Ghaniyy",
        "name_english": "The Self-Sufficient",
        "meaning": "The one who is free of all needs and completely self-sufficient.",
        "explanation": "Al-Ghaniyy is rich beyond measure and needs nothing from His creation. He is not dependent on anyone or anything for His existence or perfection. All creation is in need of Him, while He needs none.",
        "benefits": "Reflecting on this name frees the heart from attachment to creation and directs need toward Allah alone.",
        "quran_references": ["2:263", "2:267", "35:15", "47:38"],
        "usage_in_dua": "Ya Ghaniyy, enrich me with Your sufficiency so I need none but You.",
        "display_order": 88
    },
    {
        "id": 89,
        "number": 89,
        "name_arabic": "الْمُغْنِي",
        "name_transliteration": "Al-Mughni",
        "name_english": "The Enricher",
        "meaning": "The one who enriches whom He wills and frees them from need.",
        "explanation": "Al-Mughni is the one who grants sufficiency and enriches His servants. He enriches them with wealth, knowledge, contentment, and faith. True richness is the richness of the soul that He grants.",
        "benefits": "Calling upon this name seeks both material and spiritual enrichment.",
        "quran_references": ["9:28", "93:8"],
        "usage_in_dua": "Ya Mughni, enrich me with contentment and halal provision.",
        "display_order": 89
    },
    {
        "id": 90,
        "number": 90,
        "name_arabic": "الْمَانِعُ",
        "name_transliteration": "Al-Mani'",
        "name_english": "The Preventer",
        "meaning": "The one who prevents and withholds whatever He wills from His creation.",
        "explanation": "Al-Mani' withholds and prevents according to His wisdom. Sometimes what He withholds is a mercy, protecting His servant from harm. What He prevents from reaching a person may be better for them than receiving it.",
        "benefits": "Understanding this name teaches acceptance when something is withheld, trusting in Allah's wisdom.",
        "quran_references": ["3:26", "67:21"],
        "usage_in_dua": "Ya Mani', prevent harm from reaching me and protect me from evil.",
        "display_order": 90
    },
    {
        "id": 91,
        "number": 91,
        "name_arabic": "الضَّارُّ",
        "name_transliteration": "Ad-Darr",
        "name_english": "The Distressor",
        "meaning": "The one who creates distress and hardship as a test or purification.",
        "explanation": "Ad-Darr is the one who allows affliction to reach whom He wills by His wisdom. Hardships serve as tests, purification of sins, or elevation of rank. No harm can come except by His permission and decree.",
        "benefits": "Awareness of this name directs one to seek refuge in Allah alone during hardship.",
        "quran_references": ["6:17", "10:107", "48:11"],
        "usage_in_dua": "Ya Allah, I seek refuge in You from every harm and distress.",
        "display_order": 91
    },
    {
        "id": 92,
        "number": 92,
        "name_arabic": "النَّافِعُ",
        "name_transliteration": "An-Nafi'",
        "name_english": "The Benefactor",
        "meaning": "The one who creates benefit and grants what is useful to His servants.",
        "explanation": "An-Nafi' is the source of all benefit and good. No benefit reaches anyone except by His will. He grants beneficial knowledge, health, wealth, and guidance to whom He wills.",
        "benefits": "Invoking this name seeks beneficial outcomes in all endeavors.",
        "quran_references": ["10:49", "30:37", "48:11"],
        "usage_in_dua": "Ya Nafi', grant me beneficial knowledge and righteous deeds.",
        "display_order": 92
    },
    {
        "id": 93,
        "number": 93,
        "name_arabic": "النُّورُ",
        "name_transliteration": "An-Nur",
        "name_english": "The Light",
        "meaning": "The one who is the light of the heavens and the earth.",
        "explanation": "An-Nur is the light that illuminates all of creation. He guides hearts with the light of faith and illuminates the world with physical light. His light dispels the darkness of ignorance and disbelief.",
        "benefits": "Reflecting on this name seeks spiritual illumination and guidance.",
        "quran_references": ["24:35", "39:69"],
        "usage_in_dua": "Ya Nur, place light in my heart, my sight, and my hearing.",
        "display_order": 93
    },
    {
        "id": 94,
        "number": 94,
        "name_arabic": "الْهَادِي",
        "name_transliteration": "Al-Hadi",
        "name_english": "The Guide",
        "meaning": "The one who guides creation to what benefits them in this life and the next.",
        "explanation": "Al-Hadi provides guidance in all its forms: instinctual guidance to animals, intellectual guidance to humans, and spiritual guidance to the believers. He guides to the straight path and makes the truth clear.",
        "benefits": "Calling upon this name seeks guidance in all matters, especially matters of faith.",
        "quran_references": ["22:54", "25:31"],
        "usage_in_dua": "Ya Hadi, guide me to the straight path and keep me firm upon it.",
        "display_order": 94
    },
    {
        "id": 95,
        "number": 95,
        "name_arabic": "الْبَدِيعُ",
        "name_transliteration": "Al-Badi'",
        "name_english": "The Incomparable",
        "meaning": "The one who originates creation in wonderful and unprecedented ways.",
        "explanation": "Al-Badi' creates things in the most beautiful and wondrous forms without any prior example. His creativity is beyond imagination and His designs are matchless. The beauty and precision of creation reflect His incomparable artistry.",
        "benefits": "Reflecting on this name inspires wonder and appreciation for the beauty of creation.",
        "quran_references": ["2:117", "6:101"],
        "usage_in_dua": "Ya Badi', inspire me with creativity in serving Your cause.",
        "display_order": 95
    },
    {
        "id": 96,
        "number": 96,
        "name_arabic": "الْبَاقِي",
        "name_transliteration": "Al-Baqi",
        "name_english": "The Everlasting",
        "meaning": "The one whose existence is everlasting and never ends.",
        "explanation": "Al-Baqi is the one who remains forever while all else perishes. His existence has no end, and He endures eternally. Everything in creation is destined to perish, but Allah alone remains.",
        "benefits": "This name encourages investing in deeds that last and detachment from what perishes.",
        "quran_references": ["20:73", "28:88", "55:27"],
        "usage_in_dua": "Ya Baqi, grant me deeds whose rewards endure forever.",
        "display_order": 96
    },
    {
        "id": 97,
        "number": 97,
        "name_arabic": "الْوَارِثُ",
        "name_transliteration": "Al-Warith",
        "name_english": "The Inheritor",
        "meaning": "The one who inherits all things after the perishing of creation.",
        "explanation": "Al-Warith is the one to whom all possessions return after their owners perish. He is the ultimate inheritor of the heavens and the earth. Everything will return to Him, as He is the eternal owner of all.",
        "benefits": "Reflecting on this name reminds one that all possessions are temporary trusts from Allah.",
        "quran_references": ["15:23", "19:40", "28:58"],
        "usage_in_dua": "Ya Warith, let me use what You have given me in Your service before it returns to You.",
        "display_order": 97
    },
    {
        "id": 98,
        "number": 98,
        "name_arabic": "الرَّشِيدُ",
        "name_transliteration": "Ar-Rashid",
        "name_english": "The Guide to the Right Path",
        "meaning": "The one who directs all things to their proper course with perfect wisdom.",
        "explanation": "Ar-Rashid guides all matters to their correct and perfect conclusions. His guidance is always right and His direction never errs. He directs the affairs of creation with unerring wisdom and rightness.",
        "benefits": "Invoking this name seeks sound judgment and guidance to the right decisions.",
        "quran_references": ["11:87", "18:10", "72:10"],
        "usage_in_dua": "Ya Rashid, guide me to make the right decisions in all my affairs.",
        "display_order": 98
    },
    {
        "id": 99,
        "number": 99,
        "name_arabic": "الصَّبُورُ",
        "name_transliteration": "As-Sabur",
        "name_english": "The Patient",
        "meaning": "The one who is most patient and does not hasten punishment upon the disobedient.",
        "explanation": "As-Sabur is the one whose patience is beyond comprehension. He gives respite to the sinners and does not rush to punish despite His perfect ability. His patience gives time for repentance and return to Him.",
        "benefits": "Reflecting on this name teaches patience in hardship and gratitude for Allah's forbearance.",
        "quran_references": ["2:153", "3:200", "8:46"],
        "usage_in_dua": "Ya Sabur, grant me patience in trials and gratitude in ease.",
        "display_order": 99
    }
]
