[
    {
        "id": 1,
        "number": 1,
        "name_arabic": "مُحَمَّد",
        "name_transliteration": "Muhammad",
        "name_english": "The Praised One",
        "meaning": "The one who is praised repeatedly and extensively for his noble qualities.",
        "explanation": "This is the most well-known name of the Prophet, given to him at birth by his grandfather Abdul Muttalib. It signifies that he would be praised by all of creation. The name appears four times in the Quran and is the primary name by which he is known throughout the world.",
        "source": "Quran 3:144, 33:40, 47:2, 48:29",
        "display_order": 1
    },
    {
        "id": 2,
        "number": 2,
        "name_arabic": "أَحْمَد",
        "name_transliteration": "Ahmad",
        "name_english": "The Most Commendable",
        "meaning": "The one who praises Allah more than anyone else, and the most praised among creation.",
        "explanation": "This name was mentioned by Prophet Isa (Jesus) when he foretold the coming of the final Prophet. It carries the superlative meaning of praise, indicating he is the greatest in praising Allah and the most deserving of praise among mankind.",
        "source": "Quran 61:6",
        "display_order": 2
    },
    {
        "id": 3,
        "number": 3,
        "name_arabic": "الْمَاحِي",
        "name_transliteration": "Al-Mahi",
        "name_english": "The Eliminator of Disbelief",
        "meaning": "The one through whom Allah erases and eliminates disbelief and misguidance.",
        "explanation": "This name highlights the Prophet's role in removing the darkness of ignorance and disbelief from the hearts of people. Through his message, idol worship and polytheism were eradicated from Arabia and beyond. The Prophet himself mentioned this as one of his names.",
        "source": "Sahih al-Bukhari 3532, Sahih Muslim 2354",
        "display_order": 3
    },
    {
        "id": 4,
        "number": 4,
        "name_arabic": "الْحَاشِر",
        "name_transliteration": "Al-Hashir",
        "name_english": "The Gatherer",
        "meaning": "The one at whose feet mankind will be gathered on the Day of Resurrection.",
        "explanation": "This name indicates that the Prophet will be the first to be resurrected and that all of humanity will be gathered after him on the Day of Judgment. He will be the leader of mankind on that tremendous day. This is one of the five special names he mentioned for himself.",
        "source": "Sahih al-Bukhari 3532, Sahih Muslim 2354",
        "display_order": 4
    },
    {
        "id": 5,
        "number": 5,
        "name_arabic": "الْعَاقِب",
        "name_transliteration": "Al-Aqib",
        "name_english": "The Last",
        "meaning": "The last Prophet after whom there is no other Prophet.",
        "explanation": "This name signifies the finality of prophethood with Muhammad. No true prophet will come after him until the Day of Judgment. He is the seal and conclusion of the long line of prophets sent by Allah to guide humanity.",
        "source": "Sahih al-Bukhari 3532, Sahih Muslim 2354",
        "display_order": 5
    },
    {
        "id": 6,
        "number": 6,
        "name_arabic": "الْمُصْطَفَى",
        "name_transliteration": "Al-Mustafa",
        "name_english": "The Chosen One",
        "meaning": "The one chosen and selected by Allah above all of creation.",
        "explanation": "Allah chose Muhammad from among all of humanity to be His final messenger. He was selected from the best of lineages, the best of tribes, and the best of families. This name reflects his exalted status in the sight of Allah as the most honored of all creation.",
        "source": "Sahih Muslim 2276, Quran 3:33",
        "display_order": 6
    },
    {
        "id": 7,
        "number": 7,
        "name_arabic": "الرَّسُول",
        "name_transliteration": "Ar-Rasul",
        "name_english": "The Messenger",
        "meaning": "The one sent by Allah with a divine message and sacred law for all of mankind.",
        "explanation": "As a Rasul (Messenger), he was given a new divine law (Shariah) and commanded to convey it to the people. This distinguishes him as not merely a prophet who follows a previous law, but one who brings a complete and final revelation. He is referred to as Ar-Rasul numerous times in the Quran.",
        "source": "Quran 7:158, 48:29, 3:132",
        "display_order": 7
    },
    {
        "id": 8,
        "number": 8,
        "name_arabic": "النَّبِيّ",
        "name_transliteration": "An-Nabi",
        "name_english": "The Prophet",
        "meaning": "The one who receives divine revelation and news from Allah about unseen matters.",
        "explanation": "The word Nabi comes from the root meaning news or information. As An-Nabi, he received direct communication from Allah through the angel Jibreel. He informed humanity about Allah, the unseen world, the afterlife, and the path to salvation. This title appears extensively throughout the Quran.",
        "source": "Quran 7:157-158, 33:45",
        "display_order": 8
    },
    {
        "id": 9,
        "number": 9,
        "name_arabic": "الْأَمِين",
        "name_transliteration": "Al-Amin",
        "name_english": "The Trustworthy",
        "meaning": "The one who is completely trustworthy and reliable in all matters.",
        "explanation": "Even before receiving prophethood, Muhammad was known among the Quraysh as Al-Amin due to his impeccable honesty and trustworthiness. People would entrust their valuables to him for safekeeping. This reputation was so well established that even his enemies acknowledged his truthfulness.",
        "source": "Sirah Ibn Hisham, Sahih al-Bukhari",
        "display_order": 9
    },
    {
        "id": 10,
        "number": 10,
        "name_arabic": "الصَّادِق",
        "name_transliteration": "As-Sadiq",
        "name_english": "The Truthful",
        "meaning": "The one who always speaks the truth and never utters falsehood.",
        "explanation": "The Prophet was known for his absolute truthfulness throughout his life. He never lied, even in jest, and was recognized as the most truthful person in his community. Abu Sufyan, before his conversion to Islam, testified to the Roman Emperor Heraclius that Muhammad had never been known to lie.",
        "source": "Sahih al-Bukhari 7, Sirah Ibn Hisham",
        "display_order": 10
    },
    {
        "id": 11,
        "number": 11,
        "name_arabic": "طٰهٰ",
        "name_transliteration": "Taha",
        "name_english": "Taha",
        "meaning": "A name by which Allah addressed the Prophet at the opening of Surah Taha.",
        "explanation": "Taha appears at the beginning of the twentieth surah of the Quran. Many scholars consider it to be one of the names of the Prophet Muhammad. Some interpret it as meaning 'O man' or 'O pure one' in certain ancient Arabic dialects. It is commonly used as a name for the Prophet in Islamic tradition.",
        "source": "Quran 20:1",
        "display_order": 11
    },
    {
        "id": 12,
        "number": 12,
        "name_arabic": "يٰسٓ",
        "name_transliteration": "Yasin",
        "name_english": "Yasin",
        "meaning": "A name by which Allah addressed the Prophet at the opening of Surah Ya-Sin.",
        "explanation": "Ya-Sin appears at the beginning of Surah 36, which is often called the heart of the Quran. Many scholars and mufassireen (commentators) hold that it is one of the names of the Prophet Muhammad. It is followed by the verse affirming that he is indeed among the messengers sent on a straight path.",
        "source": "Quran 36:1-3",
        "display_order": 12
    },
    {
        "id": 13,
        "number": 13,
        "name_arabic": "الْمُدَّثِّر",
        "name_transliteration": "Al-Muddaththir",
        "name_english": "The Cloaked One",
        "meaning": "The one who wraps himself in a cloak or garment.",
        "explanation": "This name comes from Surah Al-Muddaththir, where Allah addresses the Prophet who had wrapped himself in his cloak after receiving the first revelation. Allah called him by this title and commanded him to rise and warn the people. It reflects the momentous beginning of his public mission.",
        "source": "Quran 74:1",
        "display_order": 13
    },
    {
        "id": 14,
        "number": 14,
        "name_arabic": "الْمُزَّمِّل",
        "name_transliteration": "Al-Muzzammil",
        "name_english": "The Enshrouded One",
        "meaning": "The one who wraps himself in garments, particularly during night prayer.",
        "explanation": "This title appears in Surah Al-Muzzammil, where Allah addresses the Prophet who used to wrap himself in his garments during the night for prayer. Allah then commanded him to stand in prayer for a portion of the night. It reflects his deep devotion and intimate connection with Allah through night worship.",
        "source": "Quran 73:1",
        "display_order": 14
    },
    {
        "id": 15,
        "number": 15,
        "name_arabic": "حَبِيبُ اللّٰه",
        "name_transliteration": "Habibullah",
        "name_english": "Beloved of Allah",
        "meaning": "The one most beloved to Allah among all of His creation.",
        "explanation": "This title signifies the special love that Allah has for Prophet Muhammad above all other creation. While Ibrahim was called Khalilullah (Friend of Allah), Muhammad holds the even higher station of being Allah's beloved. This reflects his unparalleled closeness and special relationship with the Creator.",
        "source": "Tirmidhi 3616, various hadith collections",
        "display_order": 15
    },
    {
        "id": 16,
        "number": 16,
        "name_arabic": "صَفِيُّ اللّٰه",
        "name_transliteration": "Safiullah",
        "name_english": "Chosen by Allah",
        "meaning": "The one whom Allah has purified and selected from among all people.",
        "explanation": "This name indicates that Allah chose and purified Muhammad, selecting him for the greatest mission ever entrusted to a human being. He was chosen from the purest lineage and given the most complete and final revelation. His selection was by divine wisdom and knowledge.",
        "source": "Sahih Muslim 2276",
        "display_order": 16
    },
    {
        "id": 17,
        "number": 17,
        "name_arabic": "رَحْمَةٌ لِّلْعَالَمِين",
        "name_transliteration": "Rahmatan lil-Alamin",
        "name_english": "Mercy to the Worlds",
        "meaning": "The one sent as a mercy to all of creation, including humans, jinn, animals, and all worlds.",
        "explanation": "Allah explicitly states in the Quran that He sent Muhammad as nothing but a mercy to all the worlds. His mercy encompasses believers and disbelievers alike, as his message brought justice, compassion, and guidance to all. Even nature and animals benefited from the mercy he brought to the world.",
        "source": "Quran 21:107",
        "display_order": 17
    },
    {
        "id": 18,
        "number": 18,
        "name_arabic": "خَاتَمُ النَّبِيِّين",
        "name_transliteration": "Khatam an-Nabiyyin",
        "name_english": "Seal of the Prophets",
        "meaning": "The final Prophet who sealed the chain of prophethood for all time.",
        "explanation": "This Quranic title establishes that Muhammad is the last and final prophet. No new prophet will come after him. He perfected and completed the divine message, and his prophethood serves as the seal that closes the door to any future claims of prophethood. This is a fundamental belief in Islam.",
        "source": "Quran 33:40",
        "display_order": 18
    },
    {
        "id": 19,
        "number": 19,
        "name_arabic": "النَّبِيُّ الْأُمِّيّ",
        "name_transliteration": "An-Nabi al-Ummi",
        "name_english": "The Unlettered Prophet",
        "meaning": "The Prophet who could neither read nor write, yet brought the most eloquent revelation.",
        "explanation": "This title highlights the miraculous nature of the Quran, as it was revealed to a man who had no formal education and could not read or write. This fact serves as evidence of the divine origin of the Quran, as no unlettered person could produce such a masterpiece of language and wisdom on their own.",
        "source": "Quran 7:157-158",
        "display_order": 19
    },
    {
        "id": 20,
        "number": 20,
        "name_arabic": "الشَّاهِد",
        "name_transliteration": "Ash-Shahid",
        "name_english": "The Witness",
        "meaning": "The one who bears witness over his nation and over all previous prophets and their nations.",
        "explanation": "On the Day of Judgment, Prophet Muhammad will serve as a witness over his own ummah and will testify regarding the previous nations and their prophets. He witnesses the deeds of his followers and will testify to their faith. This is one of the most significant roles he holds in the Hereafter.",
        "source": "Quran 33:45, 2:143",
        "display_order": 20
    },
    {
        "id": 21,
        "number": 21,
        "name_arabic": "الْمُبَشِّر",
        "name_transliteration": "Al-Mubashshir",
        "name_english": "The Bearer of Good Tidings",
        "meaning": "The one who brings glad tidings of Paradise and Allah's mercy to the believers.",
        "explanation": "The Prophet was sent to give good news to those who believe and do righteous deeds. He brought the promise of Allah's forgiveness, mercy, and eternal Paradise for the faithful. His message offers hope and encouragement to all who sincerely follow the path of Islam.",
        "source": "Quran 33:45, 48:8",
        "display_order": 21
    },
    {
        "id": 22,
        "number": 22,
        "name_arabic": "النَّذِير",
        "name_transliteration": "An-Nadhir",
        "name_english": "The Warner",
        "meaning": "The one who warns people against the punishment of Allah and the consequences of disbelief.",
        "explanation": "Alongside bringing glad tidings, the Prophet was tasked with warning people about the consequences of rejecting Allah's guidance. He warned about the torments of Hellfire, the trials of the grave, and the horrors of the Day of Judgment. This dual role of giving good news and warning is emphasized repeatedly in the Quran.",
        "source": "Quran 33:45, 34:28, 35:24",
        "display_order": 22
    },
    {
        "id": 23,
        "number": 23,
        "name_arabic": "السِّرَاجُ الْمُنِير",
        "name_transliteration": "As-Siraj al-Munir",
        "name_english": "The Illuminating Lamp",
        "meaning": "The radiant lamp that illuminates the path of guidance for all of humanity.",
        "explanation": "Allah describes the Prophet as a luminous, shining lamp that dispels the darkness of ignorance and misguidance. Unlike the sun which can be harsh, a lamp provides gentle, guiding light. His teachings continue to illuminate the hearts of billions of people across the world and throughout history.",
        "source": "Quran 33:46",
        "display_order": 23
    },
    {
        "id": 24,
        "number": 24,
        "name_arabic": "الدَّاعِي إِلَى اللّٰه",
        "name_transliteration": "Ad-Da'i ilallah",
        "name_english": "The Caller to Allah",
        "meaning": "The one who invites all of humanity to the worship of Allah alone.",
        "explanation": "The Prophet's primary mission was to call people to the worship of the One True God. He spent his entire prophetic life inviting people to Islam through wisdom, beautiful preaching, and the best of conduct. His call was universal, directed to all people regardless of race, status, or nationality.",
        "source": "Quran 33:46, 12:108",
        "display_order": 24
    },
    {
        "id": 25,
        "number": 25,
        "name_arabic": "الشَّفِيع",
        "name_transliteration": "Ash-Shafi",
        "name_english": "The Intercessor",
        "meaning": "The one who will intercede for his ummah on the Day of Judgment.",
        "explanation": "On the Day of Judgment, when all other prophets will say 'myself, myself,' Prophet Muhammad will intercede for his ummah before Allah. He holds the station of Al-Maqam Al-Mahmud (the Praised Station) from which he will make the Grand Intercession. This intercession is one of his unique privileges among all the prophets.",
        "source": "Sahih al-Bukhari 7510, Quran 17:79",
        "display_order": 25
    },
    {
        "id": 26,
        "number": 26,
        "name_arabic": "الْمُشَفَّع",
        "name_transliteration": "Al-Mushaffa",
        "name_english": "The One Whose Intercession is Accepted",
        "meaning": "The one whose intercession will be granted and accepted by Allah.",
        "explanation": "Not only is the Prophet an intercessor, but his intercession is guaranteed to be accepted by Allah. While others may attempt to intercede, Muhammad's intercession holds a special status and will certainly be honored. On the Day of Judgment, Allah will accept his plea on behalf of his ummah.",
        "source": "Sahih Muslim 2355, Musnad Ahmad",
        "display_order": 26
    },
    {
        "id": 27,
        "number": 27,
        "name_arabic": "الْمُقَفَّى",
        "name_transliteration": "Al-Muqaffi",
        "name_english": "The Last in Succession",
        "meaning": "The one who came last in the succession of prophets, following in their footsteps.",
        "explanation": "This name indicates that Prophet Muhammad followed in the footsteps of all previous prophets, completing and perfecting their collective mission. He confirmed the messages of all prophets who came before him while bringing the final and complete revelation. No prophet follows after him.",
        "source": "Sahih Muslim 2354",
        "display_order": 27
    },
    {
        "id": 28,
        "number": 28,
        "name_arabic": "نَبِيُّ التَّوْبَة",
        "name_transliteration": "Nabi at-Tawbah",
        "name_english": "Prophet of Repentance",
        "meaning": "The Prophet through whom the door of repentance is wide open for all sinners.",
        "explanation": "The Prophet described himself with this name, emphasizing that his message centers on Allah's willingness to accept repentance. He taught that no sin is too great for Allah's forgiveness if one sincerely repents. His mission brought the most comprehensive teachings on seeking forgiveness and returning to Allah.",
        "source": "Sahih Muslim 2355",
        "display_order": 28
    },
    {
        "id": 29,
        "number": 29,
        "name_arabic": "نَبِيُّ الرَّحْمَة",
        "name_transliteration": "Nabi ar-Rahmah",
        "name_english": "Prophet of Mercy",
        "meaning": "The Prophet whose entire mission and character embodied divine mercy.",
        "explanation": "The Prophet described himself as the Prophet of Mercy. His life was a living embodiment of compassion and mercy toward all creation. He showed mercy to enemies, animals, the elderly, children, and the poor alike. His teachings established mercy as a central principle of the Islamic way of life.",
        "source": "Sahih Muslim 2355, Quran 21:107",
        "display_order": 29
    },
    {
        "id": 30,
        "number": 30,
        "name_arabic": "نَبِيُّ الْمَلْحَمَة",
        "name_transliteration": "Nabi al-Malhamah",
        "name_english": "Prophet of the Battlefield",
        "meaning": "The Prophet who was also a leader and defender of truth through struggle and sacrifice.",
        "explanation": "This name reflects the Prophet's role as a leader who defended his community and the truth against aggression. He personally participated in battles to protect the Muslim community and establish justice. This title acknowledges his courage and strategic leadership in times of conflict.",
        "source": "Sahih Muslim 2355",
        "display_order": 30
    },
    {
        "id": 31,
        "number": 31,
        "name_arabic": "الْفَاتِح",
        "name_transliteration": "Al-Fatih",
        "name_english": "The Opener",
        "meaning": "The one through whom Allah opened the doors of guidance, mercy, and victory.",
        "explanation": "The Prophet opened the doors of guidance for humanity and was granted the opening (conquest) of Makkah and other victories. Through him, closed hearts were opened to faith, and the barriers between people and their Creator were removed. He is the key through which Allah's mercy reaches creation.",
        "source": "Quran 48:1, Dala'il an-Nubuwwah",
        "display_order": 31
    },
    {
        "id": 32,
        "number": 32,
        "name_arabic": "الْأَمِين",
        "name_transliteration": "Al-Amin",
        "name_english": "The Faithful",
        "meaning": "The one who is faithful and entrusted with the divine message.",
        "explanation": "Beyond personal trustworthiness, this title reflects that Allah entrusted Muhammad with the most important trust ever given to any human: the final revelation. He faithfully delivered every verse of the Quran without adding or removing anything. He fulfilled his trust completely before his passing.",
        "source": "Quran 81:21, Sahih al-Bukhari",
        "display_order": 32
    },
    {
        "id": 33,
        "number": 33,
        "name_arabic": "الْخَاتَم",
        "name_transliteration": "Al-Khatim",
        "name_english": "The Seal",
        "meaning": "The one who sealed the line of prophethood with finality.",
        "explanation": "As the Seal, Prophet Muhammad concluded the institution of prophethood. Just as a seal closes and authenticates a document, his prophethood closed the chain of divine messengers and authenticated all previous messages. His message serves as the final, preserved, and universal divine guidance.",
        "source": "Quran 33:40, Sahih Muslim 2354",
        "display_order": 33
    },
    {
        "id": 34,
        "number": 34,
        "name_arabic": "الْبَشِير",
        "name_transliteration": "Al-Bashir",
        "name_english": "The Bringer of Good News",
        "meaning": "The one who delivers the joyful news of Allah's reward and Paradise to the faithful.",
        "explanation": "As Al-Bashir, the Prophet came with the most beautiful and hopeful message imaginable: that Allah is merciful, forgiving, and has prepared Paradise for those who believe. He brought news of Allah's love for His servants and the eternal bliss awaiting the righteous. This role inspires hope in the hearts of believers.",
        "source": "Quran 2:119, 5:19",
        "display_order": 34
    },
    {
        "id": 35,
        "number": 35,
        "name_arabic": "الْهَادِي",
        "name_transliteration": "Al-Hadi",
        "name_english": "The Guide",
        "meaning": "The one who guides people to the straight path and to the pleasure of Allah.",
        "explanation": "The Prophet was sent as a guide for all of humanity, showing them the path to Allah's pleasure and to Paradise. While only Allah can place guidance in the heart, the Prophet provided the external guidance through his words, actions, and example. He is the most effective guide humanity has ever known.",
        "source": "Quran 42:52, 13:7",
        "display_order": 35
    },
    {
        "id": 36,
        "number": 36,
        "name_arabic": "سَيِّدُ وَلَدِ آدَم",
        "name_transliteration": "Sayyid Walad Adam",
        "name_english": "Master of the Children of Adam",
        "meaning": "The leader and chief of all human beings from the beginning of time to its end.",
        "explanation": "The Prophet himself stated this title without pride, indicating his rank as the greatest human being ever created. On the Day of Judgment, he will be the leader of all humanity. This status was granted to him by Allah and is acknowledged by all the prophets and messengers who came before him.",
        "source": "Sahih Muslim 2278, Tirmidhi 3615",
        "display_order": 36
    },
    {
        "id": 37,
        "number": 37,
        "name_arabic": "سَيِّدُ الْمُرْسَلِين",
        "name_transliteration": "Sayyid al-Mursalin",
        "name_english": "Master of the Messengers",
        "meaning": "The leader and chief of all the prophets and messengers sent by Allah.",
        "explanation": "Among the 124,000 prophets sent to humanity, Muhammad holds the highest rank. He led all the prophets in prayer during the Night Journey (Isra and Mi'raj), symbolizing his leadership over them all. Every prophet acknowledged his superiority and foretold his coming to their people.",
        "source": "Sahih Muslim 2278, Tirmidhi",
        "display_order": 37
    },
    {
        "id": 38,
        "number": 38,
        "name_arabic": "إِمَامُ الْمُتَّقِين",
        "name_transliteration": "Imam al-Muttaqin",
        "name_english": "Leader of the God-Fearing",
        "meaning": "The foremost leader and example for all who are conscious of Allah and fear Him.",
        "explanation": "The Prophet is the ultimate role model for those who seek to live a life of piety and God-consciousness (taqwa). He exemplified the highest levels of taqwa in every aspect of his life. Those who follow his example are the people of taqwa, and he is their imam and guide.",
        "source": "Tirmidhi 1553, Sahih Muslim",
        "display_order": 38
    },
    {
        "id": 39,
        "number": 39,
        "name_arabic": "خَلِيلُ الرَّحْمٰن",
        "name_transliteration": "Khalil ar-Rahman",
        "name_english": "Friend of the Most Merciful",
        "meaning": "The intimate, close friend of Allah, the Most Merciful.",
        "explanation": "The Prophet declared that if he were to take a khalil (intimate friend) from among people, it would be Abu Bakr, but instead, his Lord has taken him as His khalil. This station of khullah (intimate friendship) with Allah is the highest form of divine love and closeness, shared with Prophet Ibrahim.",
        "source": "Sahih Muslim 532, Sahih al-Bukhari 3654",
        "display_order": 39
    },
    {
        "id": 40,
        "number": 40,
        "name_arabic": "صَاحِبُ الْمَقَامِ الْمَحْمُود",
        "name_transliteration": "Sahib al-Maqam al-Mahmud",
        "name_english": "Holder of the Praised Station",
        "meaning": "The one who will be given the highest station of praise and honor on the Day of Judgment.",
        "explanation": "Al-Maqam al-Mahmud is the exalted station that Allah has promised exclusively to Prophet Muhammad on the Day of Judgment. From this station, he will make the Grand Intercession for all of humanity. All people, from the first to the last, will praise him for this intercession.",
        "source": "Quran 17:79, Sahih al-Bukhari 7510",
        "display_order": 40
    },
    {
        "id": 41,
        "number": 41,
        "name_arabic": "صَاحِبُ الْوَسِيلَة",
        "name_transliteration": "Sahib al-Wasilah",
        "name_english": "Holder of the Means of Approach",
        "meaning": "The one granted the highest rank in Paradise, called Al-Wasilah.",
        "explanation": "Al-Wasilah is a special station in Paradise that will be given to only one servant of Allah, and the Prophet expressed hope that it would be him. Muslims are encouraged to ask Allah to grant him this station after every adhan (call to prayer). It represents the closest station to the Throne of Allah in Paradise.",
        "source": "Sahih Muslim 384, Sahih al-Bukhari 614",
        "display_order": 41
    },
    {
        "id": 42,
        "number": 42,
        "name_arabic": "صَاحِبُ الْحَوْض",
        "name_transliteration": "Sahib al-Hawd",
        "name_english": "Holder of the Pool",
        "meaning": "The owner of the great Pool (Al-Kawthar) on the Day of Judgment.",
        "explanation": "On the Day of Judgment, the Prophet will have a great pool whose water is whiter than milk, sweeter than honey, and whose fragrance is more pleasant than musk. Whoever drinks from it will never experience thirst again. This pool was granted to him as a special honor from Allah.",
        "source": "Quran 108:1, Sahih al-Bukhari 6579, Sahih Muslim 2292",
        "display_order": 42
    },
    {
        "id": 43,
        "number": 43,
        "name_arabic": "صَاحِبُ اللِّوَاء",
        "name_transliteration": "Sahib al-Liwa",
        "name_english": "Bearer of the Banner",
        "meaning": "The one who will carry the Banner of Praise (Liwa al-Hamd) on the Day of Judgment.",
        "explanation": "On the Day of Resurrection, the Prophet will hold the Banner of Praise under which all prophets, from Adam to the last, will gather. This banner symbolizes his leadership over all of humanity on that day. It is one of his unique distinctions among the prophets.",
        "source": "Tirmidhi 3615, Musnad Ahmad",
        "display_order": 43
    },
    {
        "id": 44,
        "number": 44,
        "name_arabic": "أَبُو الْقَاسِم",
        "name_transliteration": "Abu al-Qasim",
        "name_english": "Father of Qasim",
        "meaning": "The father of his firstborn son Qasim, by which he was known as a kunya (honorific name).",
        "explanation": "In Arab tradition, a person is often called by the name of their firstborn child. The Prophet's eldest son was Qasim, who passed away in infancy. Despite this loss, the Prophet continued to be known by this kunya throughout his life. He prohibited others from combining his name and kunya.",
        "source": "Sahih al-Bukhari 3537, Sahih Muslim 2131",
        "display_order": 44
    },
    {
        "id": 45,
        "number": 45,
        "name_arabic": "الرَّؤُوف",
        "name_transliteration": "Ar-Ra'uf",
        "name_english": "The Compassionate",
        "meaning": "The one who is extremely compassionate and tender-hearted toward the believers.",
        "explanation": "Allah describes the Prophet in the Quran as being ra'uf (deeply compassionate) toward the believers. He felt genuine distress at the suffering of his followers and strove to ease their burdens. His compassion extended to all creation, and he demonstrated tenderness that was unparalleled among leaders.",
        "source": "Quran 9:128",
        "display_order": 45
    },
    {
        "id": 46,
        "number": 46,
        "name_arabic": "الرَّحِيم",
        "name_transliteration": "Ar-Rahim",
        "name_english": "The Merciful",
        "meaning": "The one who shows deep, abiding mercy to the believers and all of creation.",
        "explanation": "Allah uses the same attribute He uses for Himself to describe His Prophet, highlighting the immense mercy that characterized Muhammad. His mercy was not selective but encompassed enemies, strangers, animals, and even plants. This Quranic description places him at the pinnacle of human mercy and kindness.",
        "source": "Quran 9:128",
        "display_order": 46
    },
    {
        "id": 47,
        "number": 47,
        "name_arabic": "الْعَبْد",
        "name_transliteration": "Al-Abd",
        "name_english": "The Servant of Allah",
        "meaning": "The devoted servant who embodies complete submission and servitude to Allah.",
        "explanation": "Despite his exalted status, the Prophet's most honored title in the Quran is that of Allah's servant. During the Night Journey (Isra), Allah refers to him as His servant. This title represents the highest achievement a human can reach: perfect servitude to the Creator. The Prophet preferred being a servant-prophet over a king-prophet.",
        "source": "Quran 17:1, 18:1, 53:10",
        "display_order": 47
    },
    {
        "id": 48,
        "number": 48,
        "name_arabic": "الْكَرِيم",
        "name_transliteration": "Al-Karim",
        "name_english": "The Noble One",
        "meaning": "The one who possesses the most noble character and the highest generosity.",
        "explanation": "The Prophet was the most generous of all people. He never said no to anyone who asked him for something. His generosity would increase in Ramadan like the blowing wind. Beyond material generosity, he was noble in character, lineage, speech, and conduct, embodying the finest qualities of humanity.",
        "source": "Sahih al-Bukhari 6, Quran 68:4",
        "display_order": 48
    },
    {
        "id": 49,
        "number": 49,
        "name_arabic": "الْحَبِيب",
        "name_transliteration": "Al-Habib",
        "name_english": "The Beloved",
        "meaning": "The most beloved of creation to Allah and to the believers.",
        "explanation": "The Prophet is the most beloved person to Allah and should be the most beloved to every Muslim as well. True faith is not complete until one loves the Prophet more than their parents, children, and all of humanity. He embodied every lovable quality and inspired the deepest love in the hearts of his companions.",
        "source": "Sahih al-Bukhari 15, Sahih Muslim 44",
        "display_order": 49
    },
    {
        "id": 50,
        "number": 50,
        "name_arabic": "إِمَامُ الْأَنْبِيَاء",
        "name_transliteration": "Imam al-Anbiya",
        "name_english": "Leader of the Prophets",
        "meaning": "The leader who stands at the head of all the prophets and messengers of Allah.",
        "explanation": "During the Night Journey, Prophet Muhammad led all the prophets in prayer at Masjid al-Aqsa, demonstrating his leadership over them. This event confirmed his status as the imam of all prophets. Every prophet, from Adam to Isa, acknowledged his superiority and the completeness of his message.",
        "source": "Sahih Muslim 172, Sahih al-Bukhari 3394",
        "display_order": 50
    },
    {
        "id": 51,
        "number": 51,
        "name_arabic": "أُسْوَةٌ حَسَنَة",
        "name_transliteration": "Uswatun Hasanah",
        "name_english": "The Beautiful Example",
        "meaning": "The most perfect and beautiful example to follow in all aspects of life.",
        "explanation": "Allah declares in the Quran that the Prophet is the best example for anyone who hopes in Allah and the Last Day. His life provides a comprehensive model for every situation a person might face. From worship to family life, from leadership to personal conduct, his example is the standard of excellence.",
        "source": "Quran 33:21",
        "display_order": 51
    },
    {
        "id": 52,
        "number": 52,
        "name_arabic": "صَاحِبُ الشَّفَاعَةِ الْعُظْمَى",
        "name_transliteration": "Sahib ash-Shafa'ah al-Udhma",
        "name_english": "Holder of the Grand Intercession",
        "meaning": "The one exclusively granted the right to make the greatest intercession on the Day of Judgment.",
        "explanation": "When all of humanity is suffering under the intensity of the Day of Judgment, they will go from prophet to prophet seeking intercession. Each will decline until they reach Muhammad, who will prostrate before Allah and intercede for all of humanity. This Grand Intercession is his exclusive privilege.",
        "source": "Sahih al-Bukhari 7510, Sahih Muslim 193",
        "display_order": 52
    },
    {
        "id": 53,
        "number": 53,
        "name_arabic": "صَاحِبُ التَّاج",
        "name_transliteration": "Sahib at-Taj",
        "name_english": "Holder of the Crown",
        "meaning": "The one adorned with the crown of honor and distinction from Allah.",
        "explanation": "The Prophet is described as being crowned with honor and distinction by Allah. This crown represents the culmination of all noble qualities and divine honors bestowed upon him. He is crowned as the leader of humanity, the chief of the messengers, and the most honored creation of Allah.",
        "source": "Tabarani, Dala'il an-Nubuwwah",
        "display_order": 53
    },
    {
        "id": 54,
        "number": 54,
        "name_arabic": "صَاحِبُ الْمِعْرَاج",
        "name_transliteration": "Sahib al-Mi'raj",
        "name_english": "Holder of the Ascension",
        "meaning": "The one who ascended through the heavens to the highest point any creation has reached.",
        "explanation": "The Prophet was taken on a miraculous night journey from Makkah to Jerusalem and then ascended through all seven heavens to the Lote Tree (Sidrat al-Muntaha) and beyond, where no other creation has reached. There he spoke directly with Allah and received the commandment of five daily prayers.",
        "source": "Quran 17:1, 53:1-18, Sahih al-Bukhari 349",
        "display_order": 54
    },
    {
        "id": 55,
        "number": 55,
        "name_arabic": "صَاحِبُ الْبُرَاق",
        "name_transliteration": "Sahib al-Buraq",
        "name_english": "Rider of the Buraq",
        "meaning": "The one who rode the celestial mount Buraq during the Night Journey.",
        "explanation": "During the Isra and Mi'raj, the Prophet was given a special celestial mount called Buraq, a white creature larger than a donkey but smaller than a mule, which traveled at the speed of sight. This miraculous ride carried him from Makkah to Jerusalem in an instant, symbolizing the extraordinary nature of his journey.",
        "source": "Sahih al-Bukhari 3207, Sahih Muslim 162",
        "display_order": 55
    },
    {
        "id": 56,
        "number": 56,
        "name_arabic": "الْمُتَوَكِّل",
        "name_transliteration": "Al-Mutawakkil",
        "name_english": "The One Who Relies on Allah",
        "meaning": "The one who places complete and perfect trust in Allah in all matters.",
        "explanation": "The Prophet exemplified the highest form of trust in Allah (tawakkul). He relied on Allah in the most dire circumstances, whether in the Cave of Thawr during the Hijrah or on the battlefield of Badr. His trust was not passive but combined with action, showing the true meaning of reliance on the Creator.",
        "source": "Sahih al-Bukhari 2125, Quran 9:51",
        "display_order": 56
    },
    {
        "id": 57,
        "number": 57,
        "name_arabic": "الْمُخْتَار",
        "name_transliteration": "Al-Mukhtar",
        "name_english": "The Selected One",
        "meaning": "The one specifically selected by Allah from all of humanity for the final message.",
        "explanation": "Allah selected Muhammad from among all people through a process of divine choosing. He was selected from the best nation (Arabs), from the best tribe (Quraysh), from the best clan (Banu Hashim), and from the best family. This selection was by Allah's perfect knowledge and wisdom.",
        "source": "Sahih Muslim 2276, Tirmidhi 3605",
        "display_order": 57
    },
    {
        "id": 58,
        "number": 58,
        "name_arabic": "الشَّافِع",
        "name_transliteration": "Ash-Shafi'",
        "name_english": "The One Who Intercedes",
        "meaning": "The one who actively intercedes and pleads on behalf of his followers.",
        "explanation": "This name emphasizes the active role of the Prophet in seeking forgiveness and mercy for his ummah. He would weep in prayer asking Allah to save his followers. Even in this life, he interceded for people, and in the Hereafter, his intercession will be the greatest hope for the sinful among his community.",
        "source": "Sahih Muslim 202, Tirmidhi 2359",
        "display_order": 58
    },
    {
        "id": 59,
        "number": 59,
        "name_arabic": "صَاحِبُ الْقُرْآن",
        "name_transliteration": "Sahib al-Quran",
        "name_english": "Companion of the Quran",
        "meaning": "The one to whom the Quran was revealed and who embodied its teachings completely.",
        "explanation": "The Prophet's character was the Quran itself, as described by his wife Aisha. He lived every verse of the Quran, and the Quran was revealed through him to all of humanity. His relationship with the Quran was unique among all creation, as he was both its recipient and its living manifestation.",
        "source": "Sahih Muslim 746, Quran 25:30",
        "display_order": 59
    },
    {
        "id": 60,
        "number": 60,
        "name_arabic": "الْمُنْذِر",
        "name_transliteration": "Al-Mundhir",
        "name_english": "The Admonisher",
        "meaning": "The one who admonishes and alerts people about the dangers of heedlessness and sin.",
        "explanation": "The Prophet served as a firm admonisher to his people, waking them from the slumber of heedlessness. He climbed Mount Safa and called the Quraysh, warning them of the approaching punishment. His warnings were always delivered with sincerity and concern for the wellbeing of those he addressed.",
        "source": "Quran 13:7, 38:65, Sahih al-Bukhari 4770",
        "display_order": 60
    },
    {
        "id": 61,
        "number": 61,
        "name_arabic": "خَيْرُ خَلْقِ اللّٰه",
        "name_transliteration": "Khayr Khalqillah",
        "name_english": "Best of Allah's Creation",
        "meaning": "The finest and most excellent of all that Allah has created.",
        "explanation": "Muhammad is considered the best of all creation, including humans, angels, and jinn. Allah created the universe and placed Muhammad at its pinnacle. His noble character, his sacrifices, his worship, and his service to Allah and humanity are unmatched by any other being in all of creation.",
        "source": "Tirmidhi 3615, Sahih Muslim 2278",
        "display_order": 61
    },
    {
        "id": 62,
        "number": 62,
        "name_arabic": "الطَّاهِر",
        "name_transliteration": "At-Tahir",
        "name_english": "The Pure One",
        "meaning": "The one who is purified from all spiritual and physical impurities.",
        "explanation": "Allah purified the Prophet both internally and externally. His heart was physically washed by the angels with Zamzam water and filled with faith and wisdom. He was protected from major sins and purified from any spiritual blemish. His purity encompassed his thoughts, words, actions, and intentions.",
        "source": "Sahih Muslim 162, Quran 33:33",
        "display_order": 62
    },
    {
        "id": 63,
        "number": 63,
        "name_arabic": "الطَّيِّب",
        "name_transliteration": "At-Tayyib",
        "name_english": "The Good and Pure",
        "meaning": "The one who is inherently good, pleasant, and wholesome in every way.",
        "explanation": "The Prophet was good and pure in his essence, his character, his speech, and his actions. Everything about him was tayyib (good and pure). He accepted only what was pure and wholesome, and he taught that Allah is pure and accepts only what is pure. His presence brought goodness to everything around him.",
        "source": "Sahih Muslim 1015, Tirmidhi",
        "display_order": 63
    },
    {
        "id": 64,
        "number": 64,
        "name_arabic": "الْمُبَارَك",
        "name_transliteration": "Al-Mubarak",
        "name_english": "The Blessed One",
        "meaning": "The one in whom Allah has placed abundant blessings that overflow to all around him.",
        "explanation": "Everything associated with the Prophet was blessed. His companions sought blessings from his hair, his perspiration, his ablution water, and even objects he touched. His city of Madinah became blessed, his ummah was made a blessed nation, and his teachings continue to be a source of blessing for all who follow them.",
        "source": "Sahih al-Bukhari 189, Quran 21:107",
        "display_order": 64
    },
    {
        "id": 65,
        "number": 65,
        "name_arabic": "الشَّهِيد",
        "name_transliteration": "Ash-Shahid",
        "name_english": "The Testifier",
        "meaning": "The one who testifies to the truth of Allah's message and bears witness over his nation.",
        "explanation": "The Prophet bears testimony to the truth of the divine message and will testify over his ummah on the Day of Judgment. He witnessed the state of his community and will report on their deeds. His testimony carries the highest weight before Allah and cannot be contradicted.",
        "source": "Quran 2:143, 4:41",
        "display_order": 65
    },
    {
        "id": 66,
        "number": 66,
        "name_arabic": "الْمُبِين",
        "name_transliteration": "Al-Mubin",
        "name_english": "The Clear One",
        "meaning": "The one who makes the truth clear and evident through his message and example.",
        "explanation": "The Prophet made the message of Islam clear and unambiguous. He left no room for confusion in matters of faith and practice. His explanations of the Quran, his demonstrations of worship, and his answers to questions all served to make the religion perfectly clear for all generations to come.",
        "source": "Quran 12:1, 26:115",
        "display_order": 66
    },
    {
        "id": 67,
        "number": 67,
        "name_arabic": "الْمُصَدِّق",
        "name_transliteration": "Al-Musaddiq",
        "name_english": "The Confirmer",
        "meaning": "The one who confirms and validates all previous scriptures and prophets.",
        "explanation": "The Prophet confirmed the truth of all previous revelations including the Torah, the Psalms, and the Gospel, while also clarifying what had been altered in them. He affirmed the prophethood of all previous messengers and validated their original teachings. His message served as the criterion for distinguishing truth from distortion in earlier scriptures.",
        "source": "Quran 3:3, 2:97",
        "display_order": 67
    },
    {
        "id": 68,
        "number": 68,
        "name_arabic": "النُّور",
        "name_transliteration": "An-Nur",
        "name_english": "The Light",
        "meaning": "The divine light that illuminates the path of truth and dispels the darkness of ignorance.",
        "explanation": "Allah describes the Prophet as a light in the Quran. His coming brought humanity out of the darkness of ignorance and polytheism into the light of monotheism and knowledge. His face radiated light, his teachings illuminated hearts, and his guidance continues to be a beacon of light for all who seek truth.",
        "source": "Quran 5:15, 33:46",
        "display_order": 68
    },
    {
        "id": 69,
        "number": 69,
        "name_arabic": "الْعَزِيز",
        "name_transliteration": "Al-Aziz",
        "name_english": "The Mighty",
        "meaning": "The one who is honored and mighty in the sight of Allah and all of creation.",
        "explanation": "The Prophet is described as aziz (mighty, precious, dear) in the Quran. He is honored by Allah above all creation and is dear to the hearts of billions of believers. His honor is protected by Allah, and anyone who insults him is warned of severe consequences in this life and the next.",
        "source": "Quran 9:128",
        "display_order": 69
    },
    {
        "id": 70,
        "number": 70,
        "name_arabic": "الْحَرِيص",
        "name_transliteration": "Al-Haris",
        "name_english": "The Deeply Concerned",
        "meaning": "The one who is intensely eager and concerned for the guidance and welfare of his people.",
        "explanation": "Allah describes the Prophet as being deeply anxious for the welfare of his ummah. He was distressed when they suffered and was intensely eager that they be guided. His concern for his followers was so great that Allah had to console him, telling him not to grieve himself to death over those who refused to believe.",
        "source": "Quran 9:128, 18:6",
        "display_order": 70
    },
    {
        "id": 71,
        "number": 71,
        "name_arabic": "الْمُطَاع",
        "name_transliteration": "Al-Muta'",
        "name_english": "The One Who is Obeyed",
        "meaning": "The one whose commands are obeyed by the believers and by the angels.",
        "explanation": "Obedience to the Prophet is equated with obedience to Allah in the Quran. He is to be obeyed in all his commands and prohibitions. The angel Jibreel described him as being obeyed in the heavens, and the believers are commanded to obey him without reservation as part of their faith.",
        "source": "Quran 4:80, 81:21",
        "display_order": 71
    },
    {
        "id": 72,
        "number": 72,
        "name_arabic": "الْمُجْتَبَى",
        "name_transliteration": "Al-Mujtaba",
        "name_english": "The Specially Chosen",
        "meaning": "The one whom Allah specially chose and drew close to Himself.",
        "explanation": "This name indicates the special divine selection of the Prophet from among all of humanity. Allah chose him even before his birth and prepared him throughout his life for the great mission of prophethood. His selection was not arbitrary but based on Allah's perfect knowledge that he was the most worthy and capable.",
        "source": "Quran 22:75, 68:50",
        "display_order": 72
    },
    {
        "id": 73,
        "number": 73,
        "name_arabic": "الْأَوَّل",
        "name_transliteration": "Al-Awwal",
        "name_english": "The First",
        "meaning": "The first in rank, the first to intercede, and the first to enter Paradise.",
        "explanation": "Though last in chronological appearance, the Prophet is first in rank and honor among all prophets. He will be the first to be resurrected, the first to intercede, the first to cross the Sirat (bridge over Hell), and the first to knock on the gates of Paradise. In the divine decree, his prophethood was the first to be written.",
        "source": "Sahih Muslim 197, Sahih al-Bukhari 7510",
        "display_order": 73
    },
    {
        "id": 74,
        "number": 74,
        "name_arabic": "الْآخِر",
        "name_transliteration": "Al-Akhir",
        "name_english": "The Last",
        "meaning": "The last prophet to be sent, after whom no new prophet will come.",
        "explanation": "The Prophet is the final messenger in the long chain of prophets that began with Adam. His appearance marks the completion of divine guidance to humanity. His law and message are meant to endure until the Day of Judgment, as there will be no new revelation or prophet after him to update or replace his message.",
        "source": "Quran 33:40, Sahih al-Bukhari 3535",
        "display_order": 74
    },
    {
        "id": 75,
        "number": 75,
        "name_arabic": "الْمُقَدَّم",
        "name_transliteration": "Al-Muqaddam",
        "name_english": "The Foremost",
        "meaning": "The one placed at the forefront of all creation in honor and rank.",
        "explanation": "Allah has placed the Prophet ahead of all creation in honor, rank, and distinction. He is at the forefront of every good quality and every noble endeavor. In the Hereafter, he will be at the front of all humanity, leading them as their chief and intercessor before the Lord of the worlds.",
        "source": "Tirmidhi 3615, Musnad Ahmad",
        "display_order": 75
    },
    {
        "id": 76,
        "number": 76,
        "name_arabic": "الْجَامِع",
        "name_transliteration": "Al-Jami'",
        "name_english": "The Unifier",
        "meaning": "The one who unites people upon truth and gathers all noble qualities in himself.",
        "explanation": "The Prophet united the warring tribes of Arabia under the banner of Islam, creating one of the most cohesive communities in history. He also gathered in himself all the noble qualities that had been distributed among previous prophets. His message unified the core teachings of all previous revelations into one complete faith.",
        "source": "Quran 3:103, Sahih al-Bukhari",
        "display_order": 76
    },
    {
        "id": 77,
        "number": 77,
        "name_arabic": "الْمُقْتَصِد",
        "name_transliteration": "Al-Muqtasid",
        "name_english": "The Moderate One",
        "meaning": "The one who embodied balance and moderation in all affairs.",
        "explanation": "The Prophet taught and practiced moderation in all aspects of life. He warned against extremism in religion and encouraged the middle path. His way of life balanced worship with rest, seriousness with joy, and spiritual matters with worldly affairs. He established Islam as the religion of moderation and balance.",
        "source": "Sahih al-Bukhari 6461, Quran 2:143",
        "display_order": 77
    },
    {
        "id": 78,
        "number": 78,
        "name_arabic": "الْمُذَكِّر",
        "name_transliteration": "Al-Mudhakkir",
        "name_english": "The Reminder",
        "meaning": "The one who reminds humanity of their Lord and their purpose of existence.",
        "explanation": "The Prophet's primary role was to remind people of what they already knew in their fitrah (innate nature): that Allah is their Lord and that they were created to worship Him. He reminded people of death, the Hereafter, and their accountability. His entire message is a reminder to those who have forgotten their true purpose.",
        "source": "Quran 88:21, 51:55",
        "display_order": 78
    },
    {
        "id": 79,
        "number": 79,
        "name_arabic": "الْمُطَهَّر",
        "name_transliteration": "Al-Mutahhar",
        "name_english": "The Purified",
        "meaning": "The one whom Allah purified from every spiritual and moral imperfection.",
        "explanation": "Allah purified the Prophet in every sense. His heart was physically opened and washed by the angels, his character was refined to perfection, and his lineage was kept pure. Allah removed from him any trace of spiritual blemish and elevated him to the highest level of purity possible for a human being.",
        "source": "Sahih Muslim 162, Quran 33:33",
        "display_order": 79
    },
    {
        "id": 80,
        "number": 80,
        "name_arabic": "الْمُنْجِي",
        "name_transliteration": "Al-Munji",
        "name_english": "The Savior",
        "meaning": "The one through whom Allah saves people from the darkness of ignorance and Hellfire.",
        "explanation": "Through his message and intercession, the Prophet is the means by which countless souls are saved from eternal punishment. He likened himself to a man who lights a fire at night and then tries to prevent moths from flying into it. His tireless efforts to guide people away from destruction earn him this title.",
        "source": "Sahih al-Bukhari 6483, Sahih Muslim 2284",
        "display_order": 80
    },
    {
        "id": 81,
        "number": 81,
        "name_arabic": "النَّاصِح",
        "name_transliteration": "An-Nasih",
        "name_english": "The Sincere Advisor",
        "meaning": "The one who gives the most sincere and beneficial advice to all people.",
        "explanation": "The Prophet was the most sincere advisor to his ummah. His every teaching was motivated by genuine concern for the wellbeing of his followers. He never withheld beneficial advice, and he taught that the essence of religion itself is sincere counsel (nasihah). His advice encompasses every aspect of human life.",
        "source": "Sahih Muslim 55, Quran 7:62",
        "display_order": 81
    },
    {
        "id": 82,
        "number": 82,
        "name_arabic": "الْمَنْصُور",
        "name_transliteration": "Al-Mansur",
        "name_english": "The Victorious One",
        "meaning": "The one whom Allah supports and grants victory over all opposition.",
        "explanation": "Allah promised the Prophet victory and fulfilled that promise completely. Despite facing immense opposition, persecution, and warfare, the Prophet emerged victorious. Within his lifetime, Islam spread across the entire Arabian Peninsula. Allah supported him with angels in battle and with divine assistance in all his affairs.",
        "source": "Quran 110:1, 48:1-3",
        "display_order": 82
    },
    {
        "id": 83,
        "number": 83,
        "name_arabic": "خَيْرُ الْأَنَام",
        "name_transliteration": "Khayr al-Anam",
        "name_english": "Best of All People",
        "meaning": "The finest and most excellent of all human beings who have ever lived.",
        "explanation": "Among all the billions of humans who have lived and will live, Muhammad stands as the best and most excellent. His worship of Allah, his character, his service to humanity, his patience in hardship, and his gratitude in ease were all unmatched. He perfected every human virtue to its highest degree.",
        "source": "Tirmidhi 3615, various hadith collections",
        "display_order": 83
    },
    {
        "id": 84,
        "number": 84,
        "name_arabic": "سَيِّدُ الْكَوْنَيْن",
        "name_transliteration": "Sayyid al-Kawnayn",
        "name_english": "Master of Both Worlds",
        "meaning": "The master and leader in both this world and the Hereafter.",
        "explanation": "The Prophet's leadership and honor extend to both the temporal world and the eternal Hereafter. In this world, he established the greatest civilization based on justice and faith. In the Hereafter, he will lead all of humanity and be the first to intercede. His authority and honor span both realms of existence.",
        "source": "Tirmidhi 3615, Dala'il an-Nubuwwah",
        "display_order": 84
    },
    {
        "id": 85,
        "number": 85,
        "name_arabic": "عَيْنُ النَّعِيم",
        "name_transliteration": "Ayn an-Na'im",
        "name_english": "Source of Bliss",
        "meaning": "The source and fountain of blessings and spiritual delight for the believers.",
        "explanation": "Through the Prophet's teachings and guidance, believers find true spiritual bliss and contentment. His presence was a source of joy for his companions, and following his sunnah brings tranquility and happiness to the hearts of the faithful. He is the conduit through which divine blessings flow to creation.",
        "source": "Dala'il an-Nubuwwah, various Islamic texts",
        "display_order": 85
    },
    {
        "id": 86,
        "number": 86,
        "name_arabic": "عَيْنُ الْغُرّ",
        "name_transliteration": "Ayn al-Ghurr",
        "name_english": "Leader of the Radiant Ones",
        "meaning": "The leader of those who will have radiant faces on the Day of Judgment.",
        "explanation": "The Prophet's ummah will be recognized on the Day of Judgment by the marks of ablution on their bodies, making their faces radiant and bright. He will recognize them by this sign at the Pool of Kawthar. As their leader, he is the chief of all those who will have this distinctive radiance.",
        "source": "Sahih Muslim 247, Sahih al-Bukhari 136",
        "display_order": 86
    },
    {
        "id": 87,
        "number": 87,
        "name_arabic": "صَاحِبُ الْفَضِيلَة",
        "name_transliteration": "Sahib al-Fadilah",
        "name_english": "Possessor of Virtue",
        "meaning": "The one who possesses the highest level of virtue and excellence granted by Allah.",
        "explanation": "Al-Fadilah is a special rank in Paradise that the Prophet asked Allah to grant him. Beyond this specific rank, the name encompasses the reality that the Prophet possessed the highest degree of every virtue and noble quality. No human being has combined so many virtues and excellences as he did.",
        "source": "Sahih Muslim 384",
        "display_order": 87
    },
    {
        "id": 88,
        "number": 88,
        "name_arabic": "صَاحِبُ الْإِزَار",
        "name_transliteration": "Sahib al-Izar",
        "name_english": "Man of Humility",
        "meaning": "The one who was the most humble despite being the most honored of creation.",
        "explanation": "Despite his unmatched status, the Prophet lived with utmost humility. He mended his own shoes, milked his own goat, and sat on the ground with the poor. He forbade people from standing up for him as was done for kings. His humility was so genuine that strangers could not distinguish him from his companions.",
        "source": "Sahih al-Bukhari 676, Musnad Ahmad",
        "display_order": 88
    },
    {
        "id": 89,
        "number": 89,
        "name_arabic": "الضَّحُوك",
        "name_transliteration": "Ad-Dahuk",
        "name_english": "The Smiling One",
        "meaning": "The one who was always cheerful and smiling in the company of others.",
        "explanation": "The Prophet was known for his frequent and genuine smile. His companions described him as the most cheerful and pleasant-faced person they had ever met. He taught that smiling at your brother is an act of charity. His smile was one of his most endearing qualities that drew people to him and to Islam.",
        "source": "Tirmidhi 3641, Musnad Ahmad",
        "display_order": 89
    },
    {
        "id": 90,
        "number": 90,
        "name_arabic": "الْوَلِيّ",
        "name_transliteration": "Al-Wali",
        "name_english": "The Protective Friend",
        "meaning": "The close ally and protective guardian of the believers.",
        "explanation": "The Prophet is the closest friend and protector of every believer. He is closer to the believers than they are to their own selves, as stated in the Quran. His friendship and protection extend beyond this life into the Hereafter, where he will advocate for his followers and lead them to salvation.",
        "source": "Quran 33:6, 5:55",
        "display_order": 90
    },
    {
        "id": 91,
        "number": 91,
        "name_arabic": "الْمُتَوَسِّم",
        "name_transliteration": "Al-Mutawassim",
        "name_english": "The Discerning One",
        "meaning": "The one endowed with deep insight and the ability to perceive hidden truths.",
        "explanation": "The Prophet possessed extraordinary insight granted by Allah. He could perceive the true nature of people and situations. He warned his companions to beware of the insight of the believer, for he sees with the light of Allah. His own insight was the most penetrating and accurate of all human beings.",
        "source": "Tirmidhi 3127, Quran 15:75",
        "display_order": 91
    },
    {
        "id": 92,
        "number": 92,
        "name_arabic": "الْقُرَشِيّ",
        "name_transliteration": "Al-Qurashi",
        "name_english": "The Qurayshite",
        "meaning": "The one from the noble tribe of Quraysh, the guardians of the Sacred House.",
        "explanation": "The Prophet belonged to the tribe of Quraysh, the most honored tribe in Arabia, who were the custodians of the Kaaba. Allah chose this lineage for His final messenger, ensuring he came from the most respected and influential family. The Quraysh were known for their eloquence, honor, and central role in Arabian society.",
        "source": "Sahih Muslim 2276, Quran 106:1-4",
        "display_order": 92
    },
    {
        "id": 93,
        "number": 93,
        "name_arabic": "الْهَاشِمِيّ",
        "name_transliteration": "Al-Hashimi",
        "name_english": "The Hashemite",
        "meaning": "The one from the clan of Banu Hashim, the most noble branch of the Quraysh.",
        "explanation": "Banu Hashim was the noblest clan within the Quraysh, known for their generosity and leadership. The Prophet's great-grandfather Hashim established the tradition of providing food and water to the pilgrims of Makkah. From this noble lineage, Allah chose to bring forth His final messenger.",
        "source": "Sahih Muslim 2276, Tirmidhi 3605",
        "display_order": 93
    },
    {
        "id": 94,
        "number": 94,
        "name_arabic": "الْمَكِّيّ",
        "name_transliteration": "Al-Makki",
        "name_english": "The Makkan",
        "meaning": "The one born in the sacred city of Makkah, the holiest land on earth.",
        "explanation": "The Prophet was born in Makkah, the city of the Sacred House (Kaaba). His birth in this holy city was part of the divine plan, connecting him to the legacy of Prophet Ibrahim who built the Kaaba. Although he later migrated to Madinah, his Makkan origin holds special significance in Islamic tradition.",
        "source": "Sahih al-Bukhari 1583, various Sirah sources",
        "display_order": 94
    },
    {
        "id": 95,
        "number": 95,
        "name_arabic": "الْمَدَنِيّ",
        "name_transliteration": "Al-Madani",
        "name_english": "The Madinan",
        "meaning": "The one who established his community and legacy in the city of Madinah.",
        "explanation": "After the Hijrah, the Prophet made Madinah his home and the center of the Islamic state. He built the first mosque, established the constitution of Madinah, and transformed the city into the capital of a rapidly growing civilization. Madinah became illuminated by his presence, and he expressed his deep love for the city.",
        "source": "Sahih al-Bukhari 1889, Sahih Muslim 1382",
        "display_order": 95
    },
    {
        "id": 96,
        "number": 96,
        "name_arabic": "الْأَبْطَحِيّ",
        "name_transliteration": "Al-Abtahi",
        "name_english": "The One from Abtah",
        "meaning": "The one associated with the valley of Abtah (Batha) in Makkah.",
        "explanation": "Abtah or Batha refers to the valley in Makkah where the Quraysh resided. The Prophet was connected to this blessed location, and the name associates him with the very geography of the sacred land. It highlights his deep roots in the holiest region on earth and his connection to the heritage of Ibrahim.",
        "source": "Sirah Ibn Hisham, various biographical sources",
        "display_order": 96
    },
    {
        "id": 97,
        "number": 97,
        "name_arabic": "سَيِّدُ الْعَرَب",
        "name_transliteration": "Sayyid al-Arab",
        "name_english": "Chief of the Arabs",
        "meaning": "The undisputed leader and master of all the Arab people.",
        "explanation": "The Prophet was the greatest leader the Arab people have ever known. He united their fragmented tribes, elevated their status in the world, and transformed them from warring factions into a civilization that would influence human history forever. His leadership was acknowledged even by those who initially opposed him.",
        "source": "Tirmidhi 3615, various hadith collections",
        "display_order": 97
    },
    {
        "id": 98,
        "number": 98,
        "name_arabic": "خَاتَمُ الرُّسُل",
        "name_transliteration": "Khatam ar-Rusul",
        "name_english": "Seal of the Messengers",
        "meaning": "The final messenger who sealed the institution of divine messengership.",
        "explanation": "While Khatam an-Nabiyyin seals prophethood, this title specifically seals messengership. A messenger (rasul) brings a new law, and Muhammad brought the final divine law. No new shariah will come after his, and his law is meant to guide humanity for all remaining time. His message is comprehensive and eternal.",
        "source": "Quran 33:40, Sahih Muslim 2354",
        "display_order": 98
    },
    {
        "id": 99,
        "number": 99,
        "name_arabic": "الْمُصْلِح",
        "name_transliteration": "Al-Muslih",
        "name_english": "The Reformer",
        "meaning": "The greatest reformer who transformed humanity and established lasting justice.",
        "explanation": "The Prophet brought the most comprehensive and lasting reform in human history. He reformed society's treatment of women, orphans, the poor, and the enslaved. He established principles of justice, equality, and human dignity that were revolutionary for his time and remain relevant today. His reforms touched every aspect of human life.",
        "source": "Quran 3:110, various hadith collections",
        "display_order": 99
    }
]
